{"name": "Olga Tokarczuk - Living In Between","author": "Shawn Nygaard","picture_src": "https:\/\/www.astro.com\/im\/in\/rg2310_hp.jpg","tags": ["Olga Tokarczuk","Living"],"description": "On October 10, 2019, Polish writer Olga Tokarczuk won the Nobel Prize in Literature, noted by the Swedish Academy for her 'narrative imagination that with encyclopedic passion represents the crossing of boundaries as a form of life.' Olga is an important figure for the astrological community to be aware of.","is_active": true,"created": "2023\/11\/14"}
{"name": "Case study 1: Children's horoscope of Veronika","author": "Christl Oelmann","picture_src": "https:\/\/www.astro.com\/im\/in\/fc_oelmann1.jpg","tags": ["Case study","horoscope","Veronika"],"description": "This article is the first in a series of selected examples of interpretations that Christl Oelmann published on her website between 2010 and 2019 for learners to practise. We would like to thank her for her kind permission to publish them here. There are three more case studies, if you use the 'continue' arrow at the top or bottom of the article. Veronika's mother comes to a consultation with the following problem: Veronika is not stupid, but in class, when someone asks something, and also when she is doing homework, when her mother studies with her, she immediately falls into a kind of 'examination anxiety', and then she cannot even remember things she knows. Where does this come from, and what can her parents do? What would you tell her?","is_active": true,"created": "2023\/11\/07"}
{"name": "Courtesans","author": "Sue Brayne","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2311_montespan.jpg","tags": ["Courtesans"],"description": "Strictly speaking neither mistress nor prostitute, the courtesan occupies an ambiguous role in national histories - a usually educated, glamorous, strong-willed and sexually alluring companion of male monarchs and plutocrats. She nonetheless retained an independent mindset and acted largely in her own interests, thinking ahead to the time when she might need to find other protectors in a society of patriarchs. The charts of three such women are examined - do they share certain features?","is_active": true,"created": "2023\/11\/01"}
{"name": "The Saturn Return and Quarter Squares","author": "Jessica Murray","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2310_boardgame.jpg","tags": ["Saturn", "Return", "Quarter","Squares"],"description": "All transits invite us to grow further into ourselves, each planet in its own way. Jupiter, for example, motivates by giving us a green light forward; Mars motivates us with a boost of adrenalin. Less comfortably, Saturn motivates us by showing us what we could be, but are not yet. Saturn plays a long game: that of getting us to know ourselves better and better through the passage of time.","is_active": true,"created": "2023\/10\/24"}
{"name": "Tina Turner - Thunder & Lightning","author": "Shawn Nygaard","picture_src": "https:\/\/www.astro.com\/im\/in\/opa2310_tinaturner.jpg","tags": ["Tina Turner","Thunder","Lightning"],"description": "Rock-pop singing legend Tina Turner passed away on May 24, 2023, at the age of 83. Tina was born with Uranus retrograde at 19° Taurus 12', and on the day of her death Uranus was at 19° Taurus 46'. She died one week into her Uranus Return, just following the first of what would be three conjunctions total. To take a brief look at the life of this extraordinary woman from an astrological perspective, what does her birth chart reveal?","is_active": true,"created": "2023\/10\/16"}
{"name": "Astrology and the Theory of Correspondences","author": "Ray Grasse","picture_src": "https:\/\/www.astro.com\/im\/in\/rg2310_hp.jpg","tags": ["Astrology","Theory","Correspondences"],"description": "Over the years I've had any number of friendly debates with colleagues as to exactly how astrology works. During those exchanges I've come across multiple theories which try to answer that question, drawing on such wide-ranging concepts as geo-magnetism, quantum non-locality, fractals, gravity, string theory, sacred geometry, Jung's theory of 'synchronictiy,' or perhaps some subtle-but-as-yet-unknown energy of nature.","is_active": true,"created": "2023\/10\/10"}
{"name": "Gender Identity and Astrology","author": "Rozlyn Noble","picture_src": "https:\/\/www.astro.com\/im\/in\/faa2310_hp.jpg","tags": ["Gender","Astrology"],"description": "There has been a lot of rhetoric about genders in the media. When filling in forms, there are often three boxes you can tick. Are you female, male or other? Emotive articles are frequently in the news concerning gender identity and gender politics. Astrology often employs the terms 'masculine' and 'feminine' to describe the different qualities or energies of the signs and planets.","is_active": true,"created": "2023\/10\/03"}
{"name": "Working with the Sterile Fire of Vesta","author": "Jenn Zahrt","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2309_hp.jpg","tags": ["Vesta"],"description": "In late 2020, the asteroid Vesta entered tropical Virgo for an extended stay, ingressing on October 23, 2020, going retrograde at 21º 24' on January 20, 2021, stationing direct at 6º 47' Virgo on April 21, and finally emerging from the Virgin's clutches and entering the Scales on July 19, 2021. Vesta called to me, and I began an extended dialogue with her through the creation of seven talismanic oils. Along the way, she taught me some potent new lessons about her work, and how to interpret her that I would like to share.","is_active": true,"created": "2023\/09\/26"}
{"name": "The Horary Way: Is This Relationship Right For Me?","author": "Joanna Grant","picture_src": "https:\/\/www.astro.com\/im\/in\/tl2309_hp.jpg","tags": ["Horary","Relationship"],"description": "I have met a guy with whom I have a lovely connection, we get on very well, but he is going off travelling in a few months, so our relationship has to be casual. Sometimes I'm fine with this idea, as I'm not looking for anything long-term and am happy to enjoy our time together, but I also worry about getting attached and having my head wrecked again. To continue seeing him or not is my question.","is_active": false,"created": "2023\/09\/13"}
{"name": "Haumea and Makemake - Two Mysterious Forces","author": "Stefano Stracuzzi","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2309_hp.jpg","tags": ["Haumea","Makemake","Mysterious"],"description": "These are unique times for astrologers. Throughout the last three centuries, our understanding of the cosmos has been greatly enhanced by the discoveries of outer planets. Also, with several asteroids entering the realm of collective human consciousness, enormous social and intellectual changes have been evoked on a global scale. In fact, since the discovery of Uranus in the late 1700s, humanity has reached much higher levels of awareness than could even be imagined before.","is_active": false,"created": "2023\/09\/04"}
{"name": "Daimonic Astrology and the Cosmic Return","author": "Jaime Paul Lamb","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2308_hp.jpg","tags": ["Daimonic","Astrology","Cosmic Return"],"description": "Genethlialogy, or natal astrology, is predicated on the understanding that the placement and condition of the planets at the moment of a person's birth explain and contribute to that person's character and fate. These influences are what gives rise to the notion that one's soul — or psychē, if you prefer — is endowed with vices and virtues during its planetary descent; a concept rooted in the deepest strata of the Platonic tradition.","is_active": true,"created": "2023\/08\/29"}
{"name": "Stress and the the Rising Sign","author": "Kira Sutherland","picture_src": "https:\/\/www.astro.com\/im\/in\/opa2308_hp.jpg","tags": [],"description": "In Medical Astrology, there are two main charts to assess when consulting with a client. We can create a decumbiture (horary) chart for the moment the person falls ill or asks for help. This chart gives us a better sense of the present medical situation and can offer clues that help with diagnosis and possible courses of treatment. We also look to the natal chart as a blueprint of a person's core strengths and weaknesses and the lessons that may help them navigate their health issues over their lifetime.","is_active": false,"created": "2023\/08\/16"}
{"name": "Jane Goodall - Legendary Human Queen of a Primate World","author": "Jill Amery","picture_src": "https:\/\/www.astro.com\/im\/in\/faa2308_hp.jpg","tags": ["Jane Goodall","Legendary"],"description": "British primatologist, ethologist, anthropologist, and UN Messenger of Peace. Considered to be the world's foremost expert on chimpanzees, Goodall is best known for her 45-year study of social and family interactions of wild chimpanzees in Gombe Stream National Park, Tanzania. She is the founder of the Jane Goodall Institute and has worked extensively on conservation and animal welfare issues.","is_active": false,"created": "2023\/08\/14"}
{"name": "Symmetrical Astrology - Psychological Sequences and Event Ecology","author": "Gary Christen","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2308_hp.jpg","tags": ["Symmetrical Astrology","Psychological"],"description": "Are you ready to embark on an adventure in astrology and grapple with new terms, such as 'arc opening', 'resonance', 'event ecology' and 'personal points'? Then take a deep breath and read on. The author gives an introduction to Symmetrical Astrology which invites us to look at stargazing work in an entirely fresh way for the 21st Century and offers a more 3-D view of our lives.","is_active": false,"created": "2023\/08\/07"}
{"name": "Pluto Generations - From the Maxis to the Minis","author": "Wendell C. Perry","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2307_hp.jpg","tags": [],"description": "In this article, I will briefly describe the generational impact of the natal sign position of Pluto, including its shorter transits. But first, we need to understand the limitations of Generational Astrology. No one has ever learned astrology just by reading a textbook. In order to get real information about generational trends, we have to depend on polls and surveys and the observations of academics who make it their business to follow these trends.","is_active": true,"created": "2023\/07\/26"}
{"name": "Cosmic Cooking with the Astrologer and the Chef - Mars","author": "Julija Simas and Peta Santos","picture_src": "https:\/\/www.astro.com\/im\/in\/tl_cc_mars_hp.jpg","tags": ["Cosmic","Astrologer","Mars"],"description": "Mars, the ancient war god, would not be what you would automatically associate with cooking and food, yet it's curious that male chefs remain dominant in the restaurant world. It must be the love of knives and cutting! Mars relates to all things red and sharp, spiky, hot and iron-rich. It represents strength, stamina and courage.","is_active": true,"created": "2023\/07\/11"}
{"name": "The Pluto-Neptune Generations, 1939 to 2042. Part 1: Boomers to Gen X","author": "Cate Whelan","picture_src": "https:\/\/www.astro.com\/im\/in\/faa2307_hp.jpg","tags": [],"description": "Since 1939 Pluto has been moving at roughly the same rate as Neptune, and the two planets change sign at almost the same time. Because of this we have quite specific generational tendencies, described by the signs of Neptune and Pluto. This dance between the two outer planets continues until the 2040s: a hundred years of sextile companionship which defines the underlying themes of 7 generations.","is_active": true,"created": "2023\/07\/05"}
{"name": "2023 Venus Retrograde in Leo - Explore Authentic Creativity","author": "Kathryn Andren","picture_src": "https:\/\/www.astro.com\/im\/in\/opa2307_hp.jpg","tags": ["Venus","Retrograde","Leo","Creativity"],"description": "The planet Venus is the brightest object shining in the sky after the Sun and the Moon. Venus is attractive and alluring. When you see her in the sky, notice if she speaks to you softly or invites you to pay attention to something new. Learn the value of the Venus cycle and explore personal astrology affirmations for each zodiac sign.","is_active": true,"created": "2023\/07\/04"}
{"name": "Chiron in Love - The Astrology of Envy, Rage, Compassion and Wisdom","author": "Liz Greene","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2307_hp.jpg","tags": ["Astrology","Love"],"description": "Chiron's story is most clearly and poignantly enacted, not on the global stage by armies, health organisations, politicians, and politically motivated groups, but in our most personal exchanges with the people closest to us. The astrological Chiron seems to be as much an enigma today as it was at the time of its discovery in 1977.","is_active": true,"created": "2023\/07\/03"}
{"name": "Venus Retrograde in Leo","author": "Cathryn Hunter","picture_src": "https:\/\/www.astro.com\/im\/in\/ch2306_hp.jpg","tags": ["Venus","Retrograde"],"description": "In Venus retrograde we have the opportunity to consider second chances. The planet Venus will be retrograde in the sign of Leo, July 23 to September 3, 2023. In his book, Hellenistic Astrology, The Study of Fate and Fortune, Chris Brennan mentions the word retrograde comes from the Greek word anapodismos meaning “walking backwards”, or hupopodizontes meaning “retracing steps.”","is_active": false,"created": "2023\/06\/27"}
{"name": "Thinking Like an Astrologer","author": "Rod Suskin","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2306_hp.jpg","tags": ["Thinking","Astrologer"],"description": "One summer evening, I found myself as a guest speaker talking to a rather unlikely audience: the national sea bird rescue organisation. Many of them probably wondered why on earth the event organiser engaged an astrologer to give this month's talk. I wondered the same, but I have found that explaining astrology to a completely lay audience is one of the most exciting lecture experiences I have.","is_active": true,"created": "2023\/06\/20"}
{"name": "Pluto in Aquarius, a surprising association with Uranus and Ketu","author": "Bernard Duchatelle","picture_src": "https:\/\/www.astro.com\/im\/in\/tl2306_hp.png","tags": [],"description": "Pluto is in Aquarius since March 23, 2023 and we don't keep track of the lectures, webinars, articles, and videos published on this subject: we are living in an extra-ordinary age and Pluto could well be the key to the evolution of our world, for better or for worse. Is it for instance a mere coincidence that the abrupt and alarming emergence of the AI (Artificial Intelligence) is now taking place?","is_active": true,"created": "2023\/06\/12"}
{"name": "Rethinking Traditional Concepts of Dignities and Debilities","author": "Ray Grasse","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2306_hp.jpg","tags": ["Rethinking","Traditional"],"description": "On more than one occasion I've had a student or client come to me and say something along the lines of, “I have my Venus in Virgo. I've heard that this is the worst placement for Venus. Is that true?” I find comments like that disappointing, because they reflect a basic misunderstanding of horoscopes and the nature of astrology generally. We have to be careful in placing rigid value judgments on our astrological interpretations.","is_active": false,"created": "2023\/06\/02"}
{"name": "The Dwad Chart","author": "Pam Crane","picture_src": "https:\/\/www.astro.com\/im\/in\/pc_dwad_hp.png","tags": [],"description": "As in the twelfth harmonic, to calculate the Dwad, each chart factor is multiplied by twelve and converted back to degrees and minutes of longitude - but its Sign is found visually from its original, radix, sign position; every 2½ degrees of the \"parent\" sign becomes a micro-sign, and the sequence starts with the parent sign itself. Aries starts with Aries and ends with Pisces, but Taurus starts with Taurus and ends with Aries, and so on.","is_active": true,"created": "2023\/05\/24"}
{"name": "Astrology Urania & Astrology Chiron - Astrology of the Heavens & Astrology of the Hands","author": "Chris Skidmore","picture_src": "https:\/\/www.astro.com\/im\/in\/faa2305_hp.jpg","tags": ["Astrology","Urania","Chiron"],"description": "A few years ago a woman named Anna came for a consultation. She was in her late 50s, in the midst of her second Saturn Return. Australian, of Chinese descent, she was the mother of a student of mine who was learning Craniosacral Therapy. Anna had just come back from Peru where she'd been participating in ceremonies using plant medicines such as Peyote and Ayahuasca. She told me that in Peru she had been using these medicines to create a direct line to the energies underlying each of the planets.","is_active": false,"created": "2023\/05\/23"}
{"name": "Bringing Shape to Water - Saturn in Pisces 2023-2026","author": "Alexandra Karacostas","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2305_satpis_hp.jpg","tags": [],"description": "Saturn has entered Pisces on March 7, 2023, where it will remain through February 13, 2026. Saturn has an important relationship to Pisces, bringing structure and order to the boundaryless oneness of Pisces. The interests of the whole need to be reorganized and guardrails established against extremes. Saturn's power is being able to walk into a room and respectfully command attention, requiring that its issues be addressed. It will be very interesting to see how the organizing principles of Saturn play out in the Piscean arena of infinite possibility and compassion.","is_active": true,"created": "2023\/05\/23"}
{"name": "Yves Saint Laurent - Fashioning Fantasy into Reality","author": "Shane Nygaard","picture_src": "https:\/\/www.astro.com\/im\/in\/opa2305_hp.jpg","tags": ["Yves Saint Laurent","Fashioning"],"description": "As Saturn brings boundary to the boundless, form to the formless, and limit to the limitless, it is a most suitable vessel for navigating the expansive Piscean ocean. Artists and designers sail the Piscean seas of creative potential, not always guaranteed to make landfall, yet with Saturnian discipline and dedication, this wealth of possibilities can, in time, be brought into form. One such Piscean sailor is the legendary haute couture (“high fashion”) designer Yves Saint Laurent","is_active": true,"created": "2023\/05\/16"}
{"name": "Fire and the Phoenix City","author": "Kirk Little","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2305_hp.jpg","tags": ["Fire","Phoenix"],"description": "The American writer and humourist Mark Twain allegedly wisecracked that “History doesn't repeat itself, but often it rhymes”. His words came to mind as I studied two urban fires, separated by 90 years, which destroyed large parts of a city I used to call home. The first fire was caused by an act of war during the opening year of the American Revolution.","is_active": false,"created": "2023\/05\/02"}
{"name": "On Purpose, Vocation and Livelihood - Bridging the Individual and the Collective","author": "Vanessa Couto","picture_src": "https:\/\/www.astro.com\/im\/in\/faa2304_hp.jpg","tags": ["Vocation","Bridging","Collective"],"description": "From a very young age, I was fascinated by the idea of discovering my life's calling and purpose. In my vivid imagination, I thought an angel messenger would come and speak my calling to me, clearly letting me know what I was here to do. My Catholic teachers planted the idea that God would let us know our calling; I started quieting my mind to ensure I wouldn't miss the summons.","is_active": false,"created": "2023\/04\/25"}
{"name": "Chasing the Dragons - An Introduction to Draconic Astrology","author": "Victor Olliver","picture_src": "https:\/\/www.astro.com\/im\/in\/rev_olliver_draconic_hp.jpg","tags": ["Chasing","Dragon","Draconic","Astrology"],"description": "What's the book about? As the title states: it is about Draconic Astrology, and it is meant as an introduction. This is very useful, as Draconic seems to be on the rise in the astrological world, from a niche interest to ever-spreading popularity (in certain niches of the astro community). But what do Dragons have to do with astrology, you might ask. A fair question, which is explained in the first chapter of the book, which provides a brief history of Draconic Astrology.","is_active": false,"created": "2023\/04\/19"}
{"name": "Mercury Retrograde Cycles and the Astrology of Intuition","author": "Rebecca M. Farrar","picture_src": "https:\/\/www.astro.com\/im\/in\/rf2304_hp.jpg","tags": ["Mercury","Retrograde","Astrology"],"description": "With 2023 beginning and ending with Mercury in retrograde motion, this year offers a prime opportunity to more deeply examine our relationship to our own intuition and clairvoyance. If forward motion Mercury focuses on details and day-to-day thinking, retrograde motion Mercury loves the big picture and intuitive perception. Every Mercury retrograde cycle gives us a chance to listen more and plan less.","is_active": false,"created": "2023\/04\/19"}
{"name": "Pluto in Aquarius - Finding Your Muchness","author": "Georgina Sierra","picture_src": "https:\/\/www.astro.com\/im\/in\/opa2304_hp.png","tags": ["Pluto","Aquarius"],"description": "On a glorious spring day in Sydney, I met with a friend and esteemed astrologer for lunch. The conversation flowed from what was happening in our lives to astrology. “How are you tracking with your midlife transits?” “Don't ask,” she began. “I have lost all respect for Pluto. He turned my life upside down this year. I'm not the same as I was before.”","is_active": false,"created": "2023\/04\/04"}
{"name": "Multi-Dimensional Transits","author": "Dennis Elwell","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2304_hp.jpg","tags": ["Multi-Dimensional","Transits"],"description": "I have decided to talk mainly about transits because I have long been disillusioned with some of the effects that transits are supposed to produce. You see it seems that we in astrology are not exacting enough from our science. I think we have to ask whether we can refine our techniques to get something more nearly approaching perfect results.","is_active": true,"created": "2023\/04\/03"}
{"name": "The Part of Fortune in the houses - A refreshing look at an old calculated point","author": "Rosana Cueto Merayo","picture_src": "https:\/\/www.astro.com\/im\/in\/rcm_pof_hp.png","tags": ["Multi-Dimensional","Transits"],"description": "The Part of Fortune is the most well-known among the calculated points known as the Arabic Parts or Lots. Even though it is no celestial body, I have found that they work wonders for obtaining a fresh, empowering direction about our destiny as individuals, the path of personal development that C.G. Jung called individuation.","is_active": true,"created": "2023\/03\/29"}
{"name": "The Jupiter-Chiron cycle - Weaving the Ways of Wisdom","author": "Brian Clark","picture_src": "https:\/\/www.astro.com\/im\/in\/faa2303_hp.jpg","tags": ["Jupiter-Chiron cycle","Wisdom"],"description": "Two major ingresses occur in March 2023: Saturn enters Pisces March 7th, while Pluto enters Aquarius for the first time on the 23rd. Amidst these celestial thresholds, Jupiter and Chiron conjoin March 12th, inaugurating their cycle that unfolds over the next 13 years. Their new cycle invites us to reconsider their archetypal bond and how we may be more conscious of weaving their ways of wisdom together.","is_active": true,"created": "2023\/03\/27"}
{"name": "Cosmic Cooking with the Astrologer and the Chef - Venus","author": "Julija Simas and Peta Santos","picture_src": "https:\/\/www.astro.com\/im\/in\/tl_cc_venus_hp.jpg","tags": ["Cosmic"],"description": "Venus the goddess of beauty and love holds the rulership over everything beautiful, aesthetically pleasing, sweet and delicious. She answers to our tastes, what we like and dislike in arts, music and sensual pleasures. When considering Venus in cooking we want to be able to combine all of these principles into something that looks and tastes divine!","is_active": true,"created": "2023\/03\/21"}
{"name": "From Pisces New Moon to Aries New Moon 2023: a time for reflection, for waiting, as a New World Order emerges","author": "Anne Whitaker","picture_src": "https:\/\/www.astro.com\/im\/in\/aw2303_hp.jpg","tags": [],"description": "How are you feeling these days? I have been - unusually for me - pretty lackadaisical, unmotivated. Left field unpredictability, some of it welcome, some not, has been a distinct theme. Inability to make firm plans, experiencing even tentative plans having to change…sharing with fellow humans both locally in my small nation of Scotland, nationally in the UK, and internationally a general feeling that the world is falling to bits, the Old Order is no longer sustaining us and somehow has to change… Does any of this sound familiar?","is_active": true,"created": "2023\/03\/08"}
{"name": "Is Modern Astrology Really More 'Vague'?","author": "Ray Grasse","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2303_hp.jpg","tags": ["Astrology"],"description": "It won't come as a surprise to anyone who's followed the astrological field in recent years that there's something of a divide between those who adhere to more traditional methods and those practicing so-called “modern astrology” (also sometimes referred to as “psychological astrology”—but more on that in just a bit).","is_active": false,"created": "2023\/03\/08"}
{"name": "Chariklo","author": "Andrew Smith","picture_src": "https:\/\/www.astro.com\/im\/in\/tl2303_hp.png","tags": ["Chariklo"],"description": "Her presence felt yet rarely embodied; her wisdom offering insight and a fresh perspective on deeply felt matters; never one to seek acknowledgement or acclaim, this spirit guide presence within your cosmic consciousness serves to plant liminal ideals in your mental body to enable you to unite heaven with earth. Discovered on the 15th of February 1997, she is the largest known Centaur, orbiting just outside that of Saturn yet extending beyond Uranus' perihelion, with whom she is a steady 4:3 orbital resonance, generating a tone akin to the 4th in contemporary musical theory.","is_active": true,"created": "2023\/03\/07"}
{"name": "Metaphysical Psychology - The 8th Great Problem of Astrology","author": "Mike Harding","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2303_hp.jpg","tags": ["Metaphysical Psychology"],"description": "“The human being is not a discrete 'self' but born into a moment where much else is taking place…we are an amalgam of many drives that seek expression within us.” This philosophical contention challenges ways in which astrology is currently researched and practised - for instance, do Jungian psychological 'theories' (as applied to the horoscope) limit understanding of ourselves?","is_active": false,"created": "2023\/03\/01"}
{"name": "Reclaiming the Crown - The Archetype of the Queen","author": "Yolanda McAdam","picture_src": "https:\/\/www.astro.com\/im\/in\/opa2302_hp.png","tags": ["Crown"],"description": "Most of us are familiar with the three phases or archetypes of the Divine Feminine known as Maiden, Mother, and Crone (MMC). These “faces” of the feminine have passed to us through the years as representing the Triple Goddess and the Moon's three phases. In this article, I will explore why we need to retire this triune and work instead with a tetrad of Maiden, Mother, Queen, and Crone.","is_active": true,"created": "2023\/02\/28"}
{"name": "A Possible Solution to the Astrological Problem of Twins","author": "María Blaquier","picture_src": "https:\/\/www.astro.com\/im\/in\/mb_twins_hp.jpg","tags": ["Possible","Solution"],"description": "Apart from sharing genetics and DNA, twins usually have virtually identical, or at least very similar, natal charts. From an astrological standpoint, one can expect them to share the same personality traits and to have similar life experiences, especially since, in most cases, they also receive the same upbringing.","is_active": false,"created": "2023\/02\/15"}
{"name": "Pluto in Aquarius - When the Center Cannot Hold","author": "Shawn Nygaard","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2302_hp.jpg","tags": ["Pluto"],"description": "Humanity currently stands at one of the most significant transformational turning points in its long history. With climate change and the accompanying extreme temperatures and weather conditions; economies rising and falling across the globe on a dime; divisive governmental stalemates and the rise of authoritarian rule in many countries; culture seemingly eroding, with the arts and artists as we knew and experienced them being eclipsed by “content” and influencers...","is_active": false,"created": "2023\/02\/07"}
{"name": "The Sun-Earth Relationship","author": "Alison Chester-Lambert","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2302_hp.jpg","tags": ["Sun-Earth","Relationship"],"description": "The Sun is the heart, centre and life support system of a living, breathing Solar System, which is as dependant on it as any body is to its heart. The amount of power coming to Earth from the Sun is estimated at over 1kw per sq meter per second.  This energy isn't as obvious and straightforward as we might think, because it doesn't come to us in the form of heat.  Mostly it arrives as light, which is absorbed by the Earth (and sea) and then turned into heat which is released into our atmosphere.","is_active": false,"created": "2023\/02\/02"}
{"name": "The Sign of Virgo as a Learning Process","author": "Aysem Aksoy","picture_src": "https:\/\/www.astro.com\/im\/in\/aksoy2301_hp.jpg","tags": ["Sign","Virgo"],"description": "In the zodiac, the second stop on the path of learning is Virgo. Learning is different from Gemini in this process. Virgo takes over the direct self-expression, the revealed raw creativity from the previous sign, Leo, to polish and bring them to perfection. After Leo, this process is one of ore raw material processing, the process of making oneself ready to function within a larger whole and be of use to it.","is_active": false,"created": "2023\/01\/25"}
{"name": "Saturn in Pisces - Dissolving Boundaries","author": "Lynn Bell","picture_src": "https:\/\/www.astro.com\/im\/in\/opa2301_hp.png","tags": ["Saturn","Pisces"],"description": "In Pisces, Saturn loses its footing, its certainty. The maps we formerly used to navigate the world may no longer apply. Our guidance system becomes erratic. As Saturn leaves Aquarius on March 7, 2023, the last of its 'home' signs, the old rules crumble, and the new ones may be hard to grasp. We are asked to take a leap of faith and develop other forms of perception as the boundaries of the world shift and change.","is_active": true,"created": "2023\/01\/23"}
{"name": "The Draconic Synastry of a Nightmare Relationship - Oscar Wilde and Lord Alfred Douglas","author": "Victor Olliver","picture_src": "https:\/\/www.astro.com\/im\/in\/tl2301_hp.jpg","tags": ["Draconic","Synastry","Nightmare Relationship"],"description": "In Britain's 1890s, Queen Victoria's long, dreary, po-faced reign of sexual hypocrisy experienced a reality wake-up call on a spectacular scale. A scandal erupted that makes the lurid Depp\/Heard court case of 2022 look like a village panto. Two men – the famous, middle-aged playwright Oscar Wilde and the young, pretty aristocrat Lord Alfred Douglas nicknamed Bosie – had fallen in love.","is_active": false,"created": "2023\/01\/17"}
{"name": "Words as Windows or Walls: On Mars Retrograde in Gemini","author": "Colin Bedell","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2211_hp.jpg","tags": ["Retrograde","Gemini"],"description": "The current constellation of Mars retrograde in Gemini is drawing to a close: Mars will be stationary direct on January 12, 2023. You can now read the complete article on how this constellation can be used with regard to how you can improve your way of communicating.\n\n\"I feel so sentenced by your words, I feel so judged and sent away, Before I go I got to know, Is that what you mean to say?...\"","is_active": true,"created": "2023\/01\/10"}
{"name": "Cosmic Cooking with the Astrologer and the Chef - Mercury","author": "Julija Simas and Peta Santos","picture_src": "https:\/\/www.astro.com\/im\/in\/tl_cc_mercury_hp.jpg","tags": ["Cosmic"],"description": "To consider Mercury in cooking, does seem quite odd, until we look closer at this trickster's associations. Mercury is the planet associated with learning, communication, cognition, and perception, it represents how we assimilate, exchange and share information, reading, the movement and exchange of ideas through speaking, writing & networking. As messenger of the gods, he symbolizes our thoughts and our minds that can go anywhere!","is_active": false,"created": "2023\/01\/09"}
{"name": "Pluto in Aquarius in a Synchronous Universe","author": "Angela Cornish","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2301_hp.jpg","tags": [],"description": "Pluto was discovered at the Lowell Observatory on 18 March in 1930 by Clyde W. Tombaugh, an amateur astronomer from Kansas who was hired by the Observatory specifically to photograph the sky with a special camera and search for a hypothetical planet predicted from the calculations of the Observatory's founder, Percival Lowell, who had died 14 years earlier.","is_active": false,"created": "2023\/01\/02"}
{"name": "Untangling Client Issues with a Systemic Constellations Approach","author": "Elizabeth Nakata","picture_src": "https:\/\/www.astro.com\/im\/in\/opa2212_hp.jpg","tags": [],"description": "The impact of family relationships and history is inescapable. In my practice, I combine the knowledge system of astrology with the therapeutic technique of systemic or family constellations to analyze client issues and support their personal development and goal attainment.","is_active": true,"created": "2022\/12\/08"}
{"name": "Pluto in Aquarius - the Transition","author": "Stefan Hofbauer","picture_src": "https:\/\/www.astro.com\/im\/in\/sh_pluaqu_hp.jpg","tags": [],"description": "After about 15 years in Capricorn, Pluto's gradual transition into Aquarius begins in 2023. This sign change will take place in three steps. In 2023, Pluto will first change to Aquarius for about three months, and then return to Capricorn for a little more than seven months. In 2024, it will remain in Aquarius for more than seven months before returning to Capricorn for two and a half months in the fall, from where it will finally and permanently change to Aquarius on November 19, 2024.","is_active": true,"created": "2022\/12\/06"}
{"name": "Celestial Templates - Planetary Imprints in Early Childhood","author": "Erin Sullivan","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2212_hp.jpg","tags": [],"description": "Not only are children the living embodiment of a moment in time, but they are also the extension from that moment into the future — both collectively for the evolution of the human race, and for individual families to carry on their legacy. Nature has it that we are immortalized through our children by passing along our genetic inheritance as well as our planetary patterns in infinitely myriad ways.","is_active": false,"created": "2022\/12\/05"}
{"name": "Family Dilemmas in the Natal Chart","author": "María Blaquier","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2212_hp.jpg","tags": ["Dilemmas"],"description": "The birth chart is a map in which the planets, which symbolise the psychic functions, describe life trends and potential. If Heraclitus was right in stating that “character is destiny”, then we could say that the qualities with which we are born suggest the course that our life will take.","is_active": true,"created": "2022\/12\/01"}
{"name": "The Walkers","author": "Andrew Smith","picture_src": "https:\/\/www.astro.com\/im\/in\/tl2211_hp.jpg","tags": [],"description": "Standing alone, between space and time, retrieving both new and old, a mediator of worlds, a guardian of those memories stored within both the Deep Mind and the heavens, a Guide whose prompts opens pathways familiar and whose voice is felt and experienced but not heard. Alien to this physical realm yet oddly familiar, a being whose presence occasions your everyday awareness but prefers to hover just beyond the physical senses, the Walker strikes a lonely path, without permanent home or solid family, yet his presence offers insight and healing for those with eyes to hear and ears to see.","is_active": false,"created": "2022\/11\/23"}
{"name": "Moon's Nodes and Eclipses: Gemini\/Sagittarius adventures 2020-22","author": "Anne Whitaker","picture_src": "https:\/\/www.astro.com\/im\/in\/aw2211_hp.jpg","tags": [],"description": "This study explores some areas of my developing relationship with astrology in general and the Moon's Nodes in particular. It also speaks of aspects of my work as an astrology teacher and writer, focusing here on the significance of the Moon's nodal axis and eclipses in both personal and collective life.","is_active": false,"created": "2022\/11\/16"}
{"name": "Cosmic Cooking with the Astrologer and the Chef - The Moon","author": "Julija Simas and Peta Santos","picture_src": "https:\/\/www.astro.com\/im\/in\/tl_cc_moon_hp.jpg","tags": ["Cosmic"],"description": "When we think of the Moon, we think of natural rhythms, the cycles of waxing and waning, of emotional tides, of home, of emotional bonds and feelings, of memories, of comfort and security. When we add this to food, we automatically think of comfort food, of something that will satisfy and nourish, food that provides a consolation or a feeling of well-being.","is_active": true,"created": "2022\/11\/08"}
{"name": "Algol and the British Royal Family","author": "Alex Trenoweth","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2211_hp.jpg","tags": [],"description": "Dreaded fixed star Algol plays a major role in the nativities of the Windsors – including the late Queen Elizabeth II and King Charles III - and in major turning points of royal history. Algol, currently at 26° Taurus 25′, is associated with the Gorgon Medusa, who is cursed with snakes for locks of hair, and she turns all who look at her into stone. She is eventually beheaded by Perseus who uses a mirror to reflect her image back at her, so he didn't suffer being petrified.","is_active": true,"created": "2022\/11\/01"}
{"name": "Welcoming Mars into the Consulting Room","author": "Sheila R. Roher","picture_src": "https:\/\/www.astro.com\/im\/in\/opa2210_hp.jpg","tags": ["Mars"],"description": "Mars symbolizes a power and a daemon essential for living with vitality, passion, and purpose. Yet, the God of War doesn't always get the respect he merits. Indeed, we often-individually or collectively—try to stuff Mars into a closet. But he's everywhere, of course, not only at traditional Mars-ruled turfs like sporting events and wars but also in drive-by shootings and online trolling. And let's face it, he's often not at his best.","is_active": false,"created": "2022\/10\/28"}
{"name": "Words as Windows or Walls: On Mars Retrograde in Gemini","author": "Colin Bedell","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2211_hp.jpg","tags": ["Mars","Retrograde","Gemini"],"description": "We don't often talk enough about talking. We don't often discuss how to skill-build our communication strategies so that we can communicate in real time within the conversations that determine our life quality. That's why I'm looking forward to Mars retrograde in Gemini from October 30, 2022 - January 12, 2023.","is_active": false,"created": "2022\/10\/25"}
{"name": "Astrologers and The New Heretics","author": "Andy Thomas","picture_src": "https:\/\/www.astro.com\/im\/in\/tl2210_hp.png","tags": [],"description": "Astrology is a remarkable tool, sometimes referred to as the only reliable “map of the psyche” that we have. Yet, despite its continued refusal to ever go away, even in this technocratic age, astrology is often taken for granted and unpromoted by its adherents - and too often attacked by skeptical assailants who seem ignorant of even its most basic workings.","is_active": true,"created": "2022\/10\/24"}
{"name": "Steve Jobs' Cycles of Creativity","author": "Felipe Avila Reyes","picture_src": "https:\/\/www.astro.com\/im\/in\/fr2210_jobs_hp.jpg","tags": ["Steve Jobs","Creativity"],"description": "This article uses Steve Jobs' career as an example to demonstrate how planetary cycles can increase our understanding of a person's creative journey. \nThe first part presents the cyclic patterns found in Steve Jobs' career. The second part looks at planetary transits around his birth chart to tell the stories of his creative journeys towards his innovations. And the third part looks at his career from the perspective of synodic cycles to put it into the wider context of the history of the digital revolution.","is_active": false,"created": "2022\/10\/05"}
{"name": "Cosmic Cooking with the Astrologer and the Chef - The Sun","author": "Julija Simas and Peta Santos","picture_src": "https:\/\/www.astro.com\/im\/in\/tl_cc_sun_hp.jpg","tags": ["Cosmic"],"description": "We begin our series, of the astrologer and the chef, as 2 long term friends come together in C*I*A Timelord's Magazine's new column. Agent 57 Peta, our much loved C*I*A Retreat chef and Julija begin this series on astro-cooking to bring the inspiration of the planets, the zodiac and the cosmic turning into our lives with the food we eat and atmosphere we create. Our first planet is the Sun.","is_active": true,"created": "2022\/10\/04"}
{"name": "Wallis and Edward and Harry and Meghan - A Study in Synastry","author": "Wanda Sellar","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2210_hp.jpg","tags": [],"description": "Eighty-five years ago, an American divorcée spirited away a royal from the UK. In 2018, history seemed to repeat itself when Prince Harry married American divorcée Meghan Markle. There are interesting points of comparison between the two biwheel synastry charts of Wallis Simpson\/Edward VIII and Prince Harry\/Meghan Markle. But also points of contrast.","is_active": false,"created": "2022\/10\/01"}
{"name": "Tarot and Astrology","author": "Louise Edington","picture_src": "https:\/\/www.astro.com\/im\/in\/tl2209_hp.png","tags": ["Tarot","Astrology"],"description": "Both Tarot and Astrology are symbolic maps of our consciousness. Tarot is more accessible than Astrology in that it's a more intuitive form of divination and Astrology requires study. The benefit of using Astrology with Tarot is a deepening of understanding and, therefore, aids in sharpening our intuition and the ability to unlock our potential.","is_active": false,"created": "2022\/09\/27"}
{"name": "Queen Elizabeth II - A Chart Fit for a Queen","author": "Cathryn Hunter","picture_src": "https:\/\/www.astro.com\/im\/in\/ch2209_elizabethII_hp.jpg","tags": [],"description": "Queen Elizabeth II was born a Taurus with her Moon in the sign of Leo, the sign of leadership, loyalty and royalty. (Obviously not all Leo Moons are Kings and Queens, but I would venture to say that most would prefer to be treated as such). This combination embodies the qualities of strength, resolve, persistence, fearlessness, loyalty and willpower, for which she was known.","is_active": true,"created": "2022\/09\/19"}
{"name": "The Divine Zodiac - A Window into God's Mind or Simply Humanity's Greatest Work of Art?","author": "Ray Grasse","picture_src": "https:\/\/www.astro.com\/im\/in\/rg_zodiac_hp.jpg","tags": [],"description": "When I first became involved with astrology, a number of things intrigued and even startled me about this discipline. One of those was the fact that it even was accurate at all and said things about my life the astrologers I spoke to couldn't possibly have known.","is_active": true,"created": "2022\/09\/13"}
{"name": "Moon and Ceres - Archetypes of Attachment and Nurture","author": "Rebecca Farrar","picture_src": "https:\/\/www.astro.com\/im\/in\/rf2209_hp.jpg","tags": [],"description": "Every Full Moon phase we have an opportunity to invite more self-awareness and emotional wisdom through balancing our inner world of emotions with our outer world of identity - aka our Moon and Sun. When the Moon has its own space in the sky it can be an ideal time to focus on feeling what needs to be felt and attuning to our unique lunar state and attachment patterning.","is_active": true,"created": "2022\/09\/05"}
{"name": "Johnny Depp - Glimpses into the Actor's Turbulent Soul","author": "Julian Venables","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2209_hp.jpg","tags": ["Johnny Depp"],"description": "Horoscopic micro-analysis through midpoints and synastry (with the actor's former wives and girlfriends) sheds further subtle light on the Pirates of the Caribbean Hollywood star whose public court fight with ex-wife Amber Heard in Virginia astonished the world this year.","is_active": false,"created": "2022\/09\/01"}
{"name": "About the Descendant","author": "Dr. Palōmi Rānī Sheth","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2208_hp.jpg","tags": [],"description": "We first begin exploring birth charts with the Primal Triad, or Sun, Moon, and Ascendant. The Ascendant is named as such because it is on the eastern horizon where the Sun ascends into the sky at dawn. The Descendant, where the Sun descends under the horizon at dusk, is less commonly explored.","is_active": false,"created": "2022\/08\/31"}
{"name": "Pandora's Box - The Mysterious 8th House","author": "Martin Sebastian Moritz","picture_src": "https:\/\/www.astro.com\/im\/in\/tl2208_hp.jpg","tags": ["Pandora's Box"],"description": "Crises can materialise in the form of dramatic entanglements. We might find ourselves caught up in complicated situations with no easy way out. The 8th house, more than any other place in the chart, is associated with entanglements, and can indeed hold serious troubles in store. These might arise through power games, boundary crossings, or dealing with taboos.","is_active": true,"created": "2022\/08\/29"}
{"name": "Differences in Astrological Twins","author": "Marguerite dar Boggia","picture_src": "https:\/\/www.astro.com\/im\/in\/mdb_twins_hp.png","tags": [],"description": "Joseph Campbell came from an Irish Catholic family. Pio Enrico came from an Italian Catholic family.  The parents of both families were middle-class and financially successful. Both boys delighted in attending the movies.","is_active": true,"created": "2022\/08\/25"}
{"name": "Uranus: Audacity and Authenticiy","author": "Nadiya Shah","picture_src": "https:\/\/www.astro.com\/im\/in\/opa2208_hp.jpg","tags": [],"description": "The origin myth of Uranus brings us to ancient Greece, where at the beginning of time, there was nothing but a void. Out of that void came chaos, and out of the chaos emerged Gaia—the Earth. Gaia then realized she was lonely, and so out of her own body—out of the Earth, she molded, created, and gave life to Uranus.","is_active": false,"created": "2022\/08\/20"}
{"name": "Draconic Timing Techniques: Transits, Progressions and Solar Returns","author": "María Blaquier","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2106_hp.jpg","tags": ["Draconic","Transits","Progressions"],"description": "The first part of this article consists of an introduction to draconic astrology and the general principles involved. The second part deals specifically with draconic timing techniques, as illustrated by examples of Margaret Atwood, Rami Malek and Laverne Cox.","is_active": true,"created": "2022\/08\/20"}
{"name": "The Planets as Conscious Beings - A Theory of How Astrology Works","author": "David Hamblin","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2208_hp.jpg","tags": [],"description": "Ever since I first came into astrology in the 1960s, I have been concerned with the question: “How and why does astrology work?” It certainly seems to work, but nobody knows how and why. We know that the movements of the Sun and Moon affect the tides through the process of gravitation, but nobody knows of a process which might cause a small and distant planet like Pluto to have a complex and subtle influence on earthly events and on the behaviour of human beings.","is_active": true,"created": "2022\/07\/29"}
{"name": "Kuiper Belt Object Update: Tolkien's Twin Flames","author": "Kelley Hunter","picture_src": "https:\/\/www.astro.com\/im\/in\/tl2207_twinflames_hp.jpg","tags": ["Kuiper Belt","Tolkien"],"description": "In the year 2003, several Kuiper Belt Objects were discovered. Two were named for mythic figures from J.R.R.Tolkien's pre-history of Middle Earth. The astronomical tradition gives first dibs to the discoverer to suggest a name fitting the appropriate mythic category— in this case, indigenous creator deities. How delightful that Tolkien's characters were included in this category! At least two astronomers must be Tolkien fans.","is_active": false,"created": "2022\/07\/27"}
{"name": "Experiential Astrology: Bringing it Alive!","author": "Barbara Schermer","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2207_hp.jpg","tags": [],"description": "In the beginning, astrology was alive. Our ancestors had a relationship to the natural world, and the contemplation of the heavens was a vital, primal communion that brought meaning to life. Today in the West, we have an impoverished relationship to the heavens, weakened by a too-strict adherence to the Newtonian—Cartesian scientific worldview. Experiential astrology seeks to remedy this by putting us back into direct contact with our horoscopes.","is_active": false,"created": "2022\/07\/25"}
{"name": "Saturn, Neptune, and A New Look at Outer Planet Retrogrades","author": "Eme Kilkenny","picture_src": "https:\/\/www.astro.com\/im\/in\/ek2207_hp.jpg","tags": [],"description": "Saturn and Neptune together have an essential role in resolving how meaningful our life is on Earth. Once the resolution of these two planets is understood the meaning and purpose of Uranus and Pluto falls into place. The timing of when such contemplation and realisation is optimised is detailed in this text where a new look at retrogrades is proposed.","is_active": false,"created": "2022\/07\/20"}
{"name": "Homage to Astrology","author": "Ray Grasse","picture_src": "https:\/\/www.astro.com\/im\/in\/rg2207_hp.jpg","tags": ["Homage","Astrology"],"description": "I had what seemed an unusually productive session with a client not long ago. Which is to say I offered some information she seemed to find helpful, while managing to hit a few “home runs” along the way, as far as coming up with specific insights into her life and personality.","is_active": false,"created": "2022\/07\/20"}
{"name": "Guided by the Nodes - An Embodied Healing Practice","author": "Cassandra Joan Butler","picture_src": "https:\/\/www.astro.com\/im\/in\/opa2207_hp.jpg","tags": [],"description": "It's May 25th, 2022, and I'm exhausted. I realize I need to apply the Astro-therapy I've cultivated for many years to myself. I call it Universal Healing Protocol, a fusion of shiatsu (Asian finger pressure) with the precepts of astrological wisdom.","is_active": true,"created": "2022\/07\/06"}
{"name": "Jupiter in Aries 2022 - 2023","author": "Julija Simas","picture_src": "https:\/\/www.astro.com\/im\/in\/tl2207_hp.png","tags": [],"description": "The sabian oracle of the 1st degree of the zodiac is \"A mermaid emerging from the ocean\". Humanistic astrologer Dane Rudhyar writes that this degree represents: Emergence of new forms and of the potentiality of individual consciousness. Jupiter now expands and accentuates this point.","is_active": true,"created": "2022\/07\/04"}
{"name": "Ceres is an Antidote to Pluto","author": "Faye Blake","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2207_hp.jpg","tags": ["Pluto"],"description": "Which of the celestials can take on Pluto - planet of abuse, terrorism and tyranny? Step forward Ceres, dwarf planet of pleb consciousness that challenges patrician power - and is Pluto's mother-in-law!","is_active": true,"created": "2022\/07\/01"}
{"name": "Review: Mirror, Mirror - The Astrology of Famous People and the Actors who Portrayed Them","author": "Alex Trenoweth","picture_src": "https:\/\/www.astro.com\/im\/in\/rev_mirror_hp.jpg","tags": [],"description": "What an idea for a book! You really have to have an inspired moment to think this up. And that's exactly what Alex Trenoweth had, when she was watching Julie & Julia with her mother, because in her childhood the author had been a huge fan of Julia Child. During the film she was wondering how the average sized Meryll Streep could fill out the huge frame (6 feet 2 inches) of the television cook from the 1970s and 80s. But she did. Big time.","is_active": false,"created": "2022\/06\/29"}
{"name": "Powers of the Red Planet - A consideration of Mars's special aspects in the tradition of Jyotish","author": "Lars Panaro","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2206_hp.jpg","tags": [],"description": "The setting: India. The time: probably the Middle Ages. The occurrence: a rather obscure and not so obvious aspect doctrine whispered from the ethers, probably to some astrologer eccentric enough to lend an ear!","is_active": true,"created": "2022\/06\/21"}
{"name": "When someone's Saturn is on your Sun","author": "Ray Grasse","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2206_hp.jpg","tags": [],"description": "Mick Jagger, Jimi Hendrix, Jim ('Roger') McGuinn of The Byrds and others: their Saturns on his Sun did him few favours in personal encounters… In the fall of 1969, when I was 17, I went to a Rolling Stones concert in Chicago with my close friend Rick Andresen. As it turned out, the three-hour concert began with two opening acts: Terry Reid and Chuck Berry.","is_active": true,"created": "2022\/06\/01"}
{"name": "The Moonscope: A Road Map for Your Soul's Journey","author": "Amélie Gebhard","picture_src": "https:\/\/www.astro.com\/im\/in\/opa2205_hp.jpg","tags": ["Moonscope"],"description": "For thousands of years, the Moon has captivated people. Our ancestors called La Luna the “Great Mother.” The words “measure” and “Moon” have the same root. Meanwhile, the word horoscope originated from the ancient Greek words hora, or “hour,” and skopéin, “to observe.” The term Moonscope is a reference to it and describes nothing less than that: to observe the Moon.","is_active": false,"created": "2022\/05\/31"}
{"name": "Celebrity Asteroids","author": "Alex Miller","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2205_hp.jpg","tags": ["Celebrity","Asteroids"],"description": "There you are, a tiny bit of space debris, endlessly circling the Sun in a predetermined orbit that can be calculated time out of mind. So far, no one has even noted your existence, but one day, just as you are rising in Chicago, Illinois, a child is born there, who would grow to become one of America's best-loved and most talented comedic geniuses, a multiple Oscar nominee and Best Supporting Actor winner.","is_active": false,"created": "2022\/05\/18"}
{"name": "The Author Franz Kafka: Refinement of Chart Analysis with Harmonics","author": "Ferhan Çeçen","picture_src": "https:\/\/www.astro.com\/im\/in\/fc2206_harmonics_hp.jpg","tags": ["Franz Kafka","Harmonics"],"description": "Harmonic charts show the vibration of planets with each other. They are derived from the natal chart itself. Using them it is possible to analyze a natal chart like under a magnifying glass. Thus, harmonic charts are nothing else than a magnification and  allow a more differentiated analysis than the natal chart itself which is the 1st harmonic chart (H1).","is_active": false,"created": "2022\/05\/17"}
{"name": "Draconic Astrology - Finding your soul purpose","author": "Victor Olliver","picture_src": "https:\/\/www.astro.com\/im\/in\/tl2205_hp.png","tags": ["Draconic"],"description": "The word 'draconic' means dragon-like. Once upon ancient times, people thought lunar and solar eclipses were the result of a dragon living in the Moon's nodes which periodically ate the Sun and Moon (what we now know as eclipses). How else to explain the curious dimming and occultations of the luminaries?","is_active": true,"created": "2022\/05\/06"}
{"name": "An Alternative Look at Kurt Cobain's Astrology","author": "Kamila Lizis","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2205_hp.jpg","tags": [],"description": "What was the truth of Kurt Cobain, the leader singer and founder of US rock band Nirvana? What was the unique melody coming from his core? And has it been heard? Kurt Donald Cobain born on 20 February 1967 at 19:38 in Aberdeen, Washington, US, openly shared a profound longing to reconnect with something more meaningful, non-superficial, perhaps of alien origin that his inner child was yearning for.","is_active": true,"created": "2022\/05\/04"}
{"name": "Debilitated Planets are Clowns","author": "Blair Bogin","picture_src": "https:\/\/www.astro.com\/im\/in\/opa2204_hp.jpg","tags": [],"description": "We've all had those face-palm moments: misjudgements, overreactions, lousy timing, crossed wires…our poised sense of self inverted. In a culture of perfectionism, one mistake can feel like a significant ego-death. Luckily, astrology loves mistakes. Training to be an astrologer means training your eye for where a chart gets stuck. Thus, astrology has many techniques for finding the “whoops”…one of those being Essential Dignity.","is_active": true,"created": "2022\/04\/19"}
{"name": "Planting with the Planets: The Astrology of Biodynamic Farming","author": "Mel Priestley","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2204_hp.jpg","tags": [],"description": "People have farmed in accordance with celestial rhythms for millennia. But in the last few decades, as large-scale conventional agriculture came to prominence, much of this wisdom - recorded in almanacs, calendars, mythology, and folklore - became disregarded or lost.","is_active": true,"created": "2022\/04\/13"}
{"name": "Who killed the cat?","author": "Lyuben Meshikov","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2204_hp.jpg","tags": [],"description": "The querent, a man in his mid-50s, shares a house with his parents, his daughter and son-in-law and their three children. They all live on separate floors and the family has three cats and two dogs. The question was asked after the querent's 80-year-old father found one of the cats dead in the yard.","is_active": false,"created": "2022\/04\/04"}
{"name": "Kepler's Perpetual Check","author": "Alvaro Artagaveytia","picture_src": "https:\/\/www.astro.com\/im\/in\/al2203_hp.jpg","tags": [],"description": "To understand the title 'Kepler's Perpetual Check', it will be necessary to give some information to the reader who is not familiar with the game \/ sport \/ science of chess. There are three possible outcomes. A game can be won, drawn or lost. The outcome is defined by two main scenarios.","is_active": false,"created": "2022\/03\/30"}
{"name": "Crimes of Passion","author": "Britanie Leclair","picture_src": "https:\/\/www.astro.com\/im\/in\/tl2203_hp.png","tags": [],"description": "Human beings are no strangers to passion, the innate, emotional desire that attracts us to someone or something. Oftentimes, passion can be a motivator that leads us to follow our dreams and achieve success. However, when expressed in a maladaptive manner, this primal human emotion can quickly be perverted into something more akin to a dangerous obsession and\/or infatuation.","is_active": true,"created": "2022\/03\/29"}
{"name": "One Hundred Years of Chanel No. 5","author": "Wanda Sellar","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2203_hp.jpg","tags": [],"description": "Launched in 1921, Chanel No. 5 continues to hold its place within the five top-selling perfumes in the world. Gabrielle (Coco) Chanel, already a highly successful couturier, decided that she ought to have a perfume to complement her famous dress designs. She scored in fashion with simple, elegant lines. Now, she scored with a simple, rectangular perfume bottle.","is_active": false,"created": "2022\/03\/17"}
{"name": "The Importance of Harmonics","author": "David Hamblin","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2203_hp.png","tags": [],"description": "Harmonics had seemed to have fallen into disuse but there are signs of a revival - they can yield fascinating new insights into the interpretation of charts which otherwise would not be available.","is_active": true,"created": "2022\/03\/07"}
{"name": "Planets and Plants - Saturn, Jupiter, Mars","author": "Nicky Allison","picture_src": "https:\/\/www.astro.com\/im\/in\/tl2202_hp.jpg","tags": [],"description": "Is there a place for Medical Astrology in this day and age? You betcha! It has come a long way since the times of Paracelsus, Hippocrates and Galen, and bridging the gap between the 17th Century and today is Nicholas Culpeper, whose Complete Herbal has been in continuous publication since it was first published in 1652.","is_active": true,"created": "2022\/02\/24"}
{"name": "The Age Point in Astrology and the Author Franz Kafka","author": "Ferhan Çeçen","picture_src": "https:\/\/www.astro.com\/im\/in\/opa2202_hp.jpg","tags": [],"description": "Due his extraordinarily original works, Franz Kafka (1883-1924), is considered one of the most important authors of the 20th century, known for his bizarre and absurd stories and novels. In this article, we explore the value of the AGE POINT (AP) to explore the different milestones of Kafka's life.","is_active": true,"created": "2022\/02\/23"}
{"name": "Uranus in Taurus - The Irresistible Force Meets the Immovable Object","author": "Sue Tompkins","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2202_hp.png","tags": ["Uranus","Taurus"],"description": "Whatever events and changes Uranus in Taurus might bring, many of them will have been set in motion some time ago. Uranus and Taurus are an interesting combination to attempt to fathom. Taurus — the sign that, out of the entire zodiac, is the most resistant to change — meets the planet that insists upon it. Uranus challenges the status quo and forces both the individual and society to change and, in particular, to break with the past.","is_active": false,"created": "2022\/02\/21"}
{"name": "An Astrologer's Job Description","author": "Anne Whitaker","picture_src": "https:\/\/www.astro.com\/im\/in\/rev_awpostcards_hp.png","tags": ["Astrologer","Job Description"],"description": "Every so often, someone asks me what I think my job as an astrologer is. It's a good question - it makes me 'return to base', as it were, and set out the basics again, both for the questioner – and for my own benefit. Here goes!","is_active": true,"created": "2022\/02\/07"}
{"name": "Timelines of Mercury","author": "Brian Clark","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2202_hp.jpg","tags": [],"description": "Mercury has a penchant for threes: it has three synodic cycles a year and it goes retrograde three times a year, each approximately for three weeks. The “sacred geometry” of the planet's cycle and its unique timetable for making decisions and undertaking other actions are examined.","is_active": false,"created": "2022\/02\/02"}
{"name": "The Motion of Pluto and Neptune in 1945-2035","author": "Yuri Yegorov and Wasyl Woloschtschuk","picture_src": "https:\/\/www.astro.com\/im\/in\/in_nepplu400.png","tags": ["Pluto","Neptune"],"description": "Neptune and Pluto are in an almost exact sextile during a long period of several decades. The aim of this article is to describe the long-lived aspect between two planets and its influence on our past and future. We combine an accurate astronomical description of this constellation with the effects it produces.","is_active": true,"created": "2022\/01\/25"}
{"name": "Exploring the First Meeting Charts","author": "Frank C. Clifford","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2201_hp.jpg","tags": ["Exploring"],"description": "In my experience, a horoscope cast for the first time two people meet\/connect is more important than a wedding chart, a midpoint chart (such as the Davison or composite), or any other horoscope cast for a pivotal moment in two people's lives together.","is_active": false,"created": "2022\/01\/19"}
{"name": "Venus Retrograde in Capricorn - Acknowledge Your Ancestry","author": "Kathryn Andren","picture_src": "https:\/\/www.astro.com\/im\/in\/opa2201_hp.jpg","tags": ["Venus"],"description": "The planet Venus is the brightest object shining in the sky after the Sun and the Moon. If you look up and listen to her, you might notice she is speaking to you softly, or maybe radically raging for you to pay attention to what is important.","is_active": false,"created": "2022\/01\/12"}
{"name": "Diana and Georgiana - Echoes across time","author": "Joyce Westwood","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2201_hp.jpg","tags": [],"description": "The celebrated but troubled lives of Georgiana, Duchess of Devonshire, and her relative Diana, Princess of Wales are separated by over two centuries, yet the similarities between them in their personal lives and public roles are uncanny, as their birth charts demonstrate.","is_active": true,"created": "2022\/01\/11"}
{"name": "The Astrology of Bond - James Bond","author": "Ra Rishikavi Raghudas","picture_src": "https:\/\/www.astro.com\/im\/in\/tl2112bond_theme.png","tags": ["Astrology","Bond"],"description": "The famous theme plays and a gun barrel frames a striding figure in a tuxedo--who suddenly turns and fires. The gun barrel drips red, and the adventure begins. These yarns about vanquishing megalomaniacs and thus saving the world can star only one man: that paragon of alpha-malehood and suavity... sophisticated and yet raw...the most famous secret agent in the world--007 himself, James Bond.","is_active": false,"created": "2021\/12\/21"}
{"name": "Review: Postcards to the Future: Mercurial Musings 1995-2021","author": "Anne Whitaker","picture_src": "https:\/\/www.astro.com\/im\/in\/rev_awpostcards_hp.png","tags": [],"description": "There's always the right moment for everything, they say. And so it happens that these last months since Anne Whitaker send me this wonderful book as a token of friendship and long-standing cooperation, I have been incredibly busy and there was never a moment when I could take time to appreciate this gift. Now, as the darkest time of year approaches, the time has come to delve deep into the mysteries of the fine craft of astrology as practiced and experienced by this excellent astrologer.","is_active": true,"created": "2021\/12\/17"}
{"name": "Dwarf Planets as Higher Octaves","author": "Alan Clay","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2112_hp.png","tags": ["Dwarf"],"description": "When Uranus and Neptune, the first outer planets, were discovered, one way of understanding these new energies was the concept of a “higher octave.” According to the theory of higher octaves, the energy of an inner planet gets expressed at a more spiritual level. Uranus was considered the higher octave of Mercury and Neptune the higher octave of Venus. After Pluto was discovered, it became known as a higher octave of Mars.","is_active": false,"created": "2021\/12\/14"}
{"name": "The Astrology of Hollywood's Golden Year - 1939","author": "Ray Grasse","picture_src": "https:\/\/www.astro.com\/im\/in\/rg2112_hp.jpg","tags": [],"description": "Various years have been singled out by film critics as the “greatest” for film production, with some of the candidates proposed including 1962, 1972, 1994, 1999, or 2007.  But the general consensus among most cinephiles have focused on 1939 as Hollywood's most distinguished “Golden Year.”","is_active": false,"created": "2021\/12\/08"}
{"name": "The Predictive Power of Eclipses","author": "Bill Meridian","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2112_hp.jpg","tags": [],"description": "This lecture - delivered on 27 June 2020 at the online Astrological Association Conference - traces the development of eclipse analysis which is regarded as one of the most powerful tools in astrology, as demonstrated in a series of amazing examples by a leading financial and world affairs forecaster.","is_active": true,"created": "2021\/12\/03"}
{"name": "Mirror Mirror - The Astrology of Famous People and the Actors Who Have Portrayed Them","author": "Alex Trenoweth","picture_src": "https:\/\/www.astro.com\/im\/in\/ivccn2111_hp.jpg","tags": [],"description": "In the summer of 2009, I persuaded my mother to watch Julie & Julia with me. As a kid, I was fascinated with Julia Child and I'd faithfully watch her on television. I didn't understand what she was doing but I loved the way she did what she did with such passion. By the time she died, just a few days before her 92nd birthday, I still hadn't understood her unique contributions to fine cuisine. Julie & Julia changed all that.","is_active": false,"created": "2021\/11\/24"}
{"name": "Venus Lens: Seeing Transits Through Rose-Coloured Glasses","author": "Shu Yap","picture_src": "https:\/\/www.astro.com\/im\/in\/opa2111_hp.jpg","tags": [],"description": "On a frosty morning in winter last year, I stood on top of a hill on my property before dawn, waiting to see Venus as she made her first appearance in the morning sky after being invisible for the past couple of weeks. As I shivered and waited patiently among the birdsongs, my imagination brought me back to a time 5000 years ago when the ancient Sumerian peoples were looking at this same star.","is_active": true,"created": "2021\/11\/23"}
{"name": "Transits at Midlife - How the Outer Planets Change Everything","author": "Rod Suskin","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2111_hp.jpg","tags": [],"description": "As a model and mirror of our lives, astrology has a special ability to accurately time not only the unfolding of unique personal changes in our lives, but also the milestones of life both familiar and forgotten. In this article, I will look at the meanings of the major “midlife crisis” transits and consider how best to navigate them.","is_active": false,"created": "2021\/11\/17"}
{"name": "Lucinda Riley - How fated was her global literary success?","author": "Sue Brayne","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2111_hp.jpg","tags": [],"description": "Irish-born author Lucinda Riley was a literary star. I only recently discovered her through her The Seven Sisters novel.Based on the mythology of the Pleiades constellation, it's the first in the Seven Sisters Series of equally enormous books, setting up the individual stories of seven sisters, their enigmatic father who adopted them, and their subsequent journeys to find their birth parents.","is_active": true,"created": "2021\/11\/01"}
{"name": "The Seasons of the Year and Astrology - The Archetypal Cycle","author": "Manuel Ignacio Quiles","picture_src": "https:\/\/www.astro.com\/im\/in\/mq_seasons_hp.jpg","tags": [],"description": "Modern human beings have lost intimate contact with the seasons, but agricultural or peasant peoples were much more aware of them. However, seasons are still so important that they define the basic cycle of astrological signs. The name \"seasons\" refers to the stages and stations of the Sun in the sky, just like the stations in a train trip.","is_active": false,"created": "2021\/10\/28"}
{"name": "An Interview with Dennis Elwell","author": "Garry Phillipson","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2110_hp.jpg","tags": ["Interview","Dennis Elwell"],"description": "When it comes to interpreting astrological charts Dennis Elwell was a virtuoso - blending a rigorous approach to technique with a creative, even playful, engagement at a symbolic level. It would not, however, do justice to his astrological analyses to treat them only as rich samples of the science\/art of astrology, for in Dennis's hands the real significance of astrological work is that it yields hints and intimations of “the activity of an all-pervading cosmic mind” and of our relationship to it.","is_active": false,"created": "2021\/10\/19"}
{"name": "The Natal Lunar Phase and Compatibility","author": "April Elliott Kent","picture_src": "https:\/\/www.astro.com\/im\/in\/opa2110_hp.jpg","tags": ["Natal Lunar Phase","Compatibility"],"description": "I was born with the Sun in Leo and the Moon in Gemini, so naturally, I've got to start out by telling you a story. It begins on a hot, sweaty Saturday afternoon in August 1961. Dee was 8 1/2 months pregnant. At the age of 27, she'd already had three children and hadn't wanted another; after this one was born, she told her friend Helen, she was definitely going on the Pill.","is_active": true,"created": "2021\/10\/18"}
{"name": "Spirals of consciousness - Pleiadian-Earth Energy Astrology","author": "Pia Orleane and Cullen Baird Smith","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2110_hp.jpg","tags": [],"description": "Pleiadian-Earth Energy Astrology is the only known system based on the cosmic energies that spiral (unnoticed) through the distinct levels of human consciousness, using the Seven Sisters of the Pleiades as guide points on astrological maps. In this special book excerpt, the authors introduce their ideas.","is_active": false,"created": "2021\/10\/01"}
{"name": "Come Together: The Synergy of the Beatles","author": "Franco Minatel","picture_src": "https:\/\/www.astro.com\/im\/in\/ivccn2109_hp.jpg","tags": ["Synergy","Beatles"],"description": "With the Davison chart, you can find the average of the birth times to come up with a date and time. The same goes for the place.  We can study a group using the Davison chart. Let's take the Beatles, for instance. The Sun is in the 12th house of self-undoing, and the Beatles were the cause of their own demise.","is_active": false,"created": "2021\/09\/22"}
{"name": "Rooting into Relaxation with the IC","author": "Briana Saussy","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2109_hp.jpg","tags": ["Rooting"],"description": "For some, this autumn will mark the first return to face-to-face learning in more than 18 months. For all of us, the return to school now holds all of the usual questions: Will my children like their teachers? Will they have friends in their classes? Will they be OK? Plus the less usual questions: What are current infection rates? What does community transmission look like in my area? What are the school's vaccine policies? This is Back to School 2021, so the need to be familiar with what can bring rest, relaxation, nourishment, and ease into our children's lives (and our own!) is now felt more keenly than ever. And so, I look to the IC.","is_active": true,"created": "2021\/09\/20"}
{"name": "The Beatles - Harbingers of the Aquarian Age?","author": "Ray Grasse","picture_src": "https:\/\/www.astro.com\/im\/in\/rg_beatles_hp.jpg","tags": [],"description": "While I was in college during the 1970s, I had a debate one afternoon with a fellow student about popular culture in particular, the Beatles. My friend was a true believer in the superiority of classical music to anything currently offered up by pop culture. When the subject turned to the Beatles, he suggested they offered nothing of lasting value to culture.  “100 years from now,” he said, “they'll be completely forgotten.” I politely disagreed.","is_active": false,"created": "2021\/09\/20"}
{"name": "Billie Eilish: The Gen Z megastar","author": "Tim Burness","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2109_burness_hp.png","tags": ["Billie Eilish"],"description": "With 87 million followers on Instagram alone, the singer-songwriter phenomenon is riding high once again with a new album and the latest Bond film about to be released - and she's still not 20. We take a closer look at her nativity and how certain major transits this year are impacting on her development.","is_active": true,"created": "2021\/09\/01"}
{"name": "Billie Eilish: from girl to woman under Juno","author": "Christina Rodenbeck","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2109_rodenbeck_hp.jpg","tags": ["Billie Eilish"],"description": "Integer tincidunt ante vel ipsum. Praesent blandit lacinia erat. Vestibulum sed magna at nunc commodo placerat. Praesent blandit. Nam nulla. Integer pede justo, lacinia eget, tincidunt eget, tempus vel, pede. Morbi porttitor lorem id ligula.","is_active": false,"created": "2021\/09\/01"}
{"name": "Citizen Snowden","author": "Jessica Murray","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2108_hp.jpg","tags": [],"description": "What makes someone risk his personal security for a public goal? Some people seem fated to embody the big, difficult ideas with which their collective is struggling. Edward Snowden, for example, was leading a remarkably unremarkable life that exploded into something extraordinary. This happened after he leaked classified data from the National Security Agency (NSA) to the media in June 2013. It was a move with profound ramifications for himself, his society, and the age we live in.","is_active": false,"created": "2021\/08\/16"}
{"name": "Palmistry as a Divination Tool","author": "Anne C. Ortelee","picture_src": "https:\/\/www.astro.com\/im\/in\/opa2108_hp.jpg","tags": ["Palmistry"],"description": "'Your Palm is God's road map to your Soul', said my Palmistry Teacher, Ellen Goldberg during an introductory lecture. Following her lecture, I went up to compliment her on the quality of information conveyed.  She said “Stick 'em up!”.  So, I raised my hands!!  Ellen made a few amazing and very pithy observations from a 4 second observation. I was hooked!!","is_active": true,"created": "2021\/08\/11"}
{"name": "Beethoven and Mozart - Towards a more perfect and elegant model: Sagittarius and Aquarius in classical composers' charts","author": "Carol Ferris","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2108_hp.jpg","tags": [],"description": "Music is in the stars. Most obviously, it appears as the constellation Lyra (Latin for lyre). The original instrument was crafted from a tortoise shell by Hermes, then was gifted to his half-brother Apollo, and in turn given to Apollo's son Orpheus, the musician to the Argonauts. Shakespeare said of Orpheus: “Everything that heard him play\/Even the billows of the sea\/Hung their heads, and then lay by”. The Roman poet Ovid, writing about the constellation, refers to the seven strings of the Pleiades.","is_active": false,"created": "2021\/08\/03"}
{"name": "The Overconfidence of Jupiter","author": "Marguerite dar Boggia","picture_src": "https:\/\/www.astro.com\/im\/in\/mdb_jupiter_hp.jpg","tags": ["Overconfidence","Jupiter"],"description": "On January 19, 2013 an airplane hit a power line, crashed and the occupant was killed. The true name of the occupant is being withheld.  He will be referred to as “Pete”. Pete has Jupiter, the ruler of the Sagittarius ascendant, within one degree of the MC. That is an aspect one deserves for ones benevolence exhibited in past lives. Everyone thought highly of him.","is_active": true,"created": "2021\/07\/19"}
{"name": "Why Magic, And Why Now - The Revival of Astrological Magic","author": "Michael Ofek","picture_src": "https:\/\/www.astro.com\/im\/in\/opa2107_hp.jpg","tags": [],"description": "In recent years there has been a great resurgence of interest in astrological magic. Magic practitioners, astrologers, and academic scholars have been gradually rekindling the ancient art and are just beginning to grasp its importance in the history and development of philosophy, religion, and science.  In the astrological community, this was a direct follow-up to the fairly recent, and still ongoing, renaissance of ancient traditional astrology.","is_active": false,"created": "2021\/07\/07"}
{"name": "Harriet Tubman as a Magical, Mercurial Figure: An Astrological Analysis of the Combahee River Raid","author": "Thea Anderson","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2107_hp.jpg","tags": [],"description": "When Harriet Tubman was a teenager, she conjured her god to kill an evil man. The ordeal began when an overseer struck her with a metal weight, and she nearly died.  For weeks afterward, Harriet lay listless in the big house without the attention of a doctor. When Edward Bodress of Maryland looked upon Harriet, he did not see an injured girl. He saw an idle laborer. Inefficiency. Dollars lost. In due time, strange men arrived. They named their price. She would be sold further south to a chain gang, guaranteeing a dismal fate for the enslaved.","is_active": true,"created": "2021\/07\/06"}
{"name": "Introducing ... the Sunshine House System","author": "Bob Makransky","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2107_hp.jpg","tags": ["Introducing"],"description": "A call to Western practitioners to reject attempts to turn astrology into a rational science (in vain pursuit of respectability) and listen once again to the “astrology spirits”. And their advice for better forecasting and helping us activate our latent intuition? That we embrace a new house system that is already available on certain software programs.","is_active": true,"created": "2021\/07\/01"}
{"name": "Mundane Astrology and the Cycle of the Ages: Seeing the Value of a Two-Tiered Approach","author": "Ray Grasse","picture_src": "https:\/\/www.astro.com\/im\/in\/rg2106_hp.jpg","tags": [],"description": "Among the various branches of astrology is a discipline referred to as 'mundane', after the Latin word 'mundo', for world. On the whole, mundane astrology is devoted less to individual horoscopes than to developments of a broader, socio-political nature—the fortunes of nations, weather patterns, disasters, political leaders, cultural trends, and so on.","is_active": true,"created": "2021\/06\/28"}
{"name": "Hermetism, Sufism and Islamic Cosmology","author": "Öner Döşer","picture_src": "https:\/\/www.astro.com\/im\/in\/ivccn2106_hp.jpg","tags": [],"description": "Particular sciences such as 'philosophy of Nature' and cosmology made an enduring impact on the wisdom that was predominant between 10th-12nd centuries in the Islamic world. Ikhwan al-Safa, al-Biruni, Ibn Sina could be counted amongst the prevailing authors of Islamic art and sciences. These authors would give us a good idea about the school of Hermeticists and Neo-Pythagoreans, mathematicians, historians, and scholars, the Peripatetic and indirectly the Ishraqi and Sufi conception of Nature. Their doctrines, when examined carefully, provide the basic understanding behind the Islamic cosmological doctrines.","is_active": false,"created": "2021\/06\/22"}
{"name": "Observations and Axioms for More Insightful Chart Interpretation","author": "Stephen Arroyo","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2106_hp.jpg","tags": ["Observations","Axioms"],"description": "Recently, in going through my archives and files while reorganizing my office, I realized that quite a few ideas and observations that I had scribbled down quickly during my extremely busy years had not been included in my various books. Since I expect that this publication will be my last on the subject of astrology, I decided to extract the most valuable ideas, guidelines, and observations from those many pages of spontaneous notes and present them in a brief, systematic fashion in this chapter.","is_active": false,"created": "2021\/06\/09"}
{"name": "Draconic Astrology - Getting in Touch with our Deeper Self","author": "María Blaquier","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2106_hp.jpg","tags": ["Draconic Astrology"],"description": "The term DRACONIC comes from the Latin names for the Lunar Nodes: Caput Draconis, the dragon's head or Moon's North Node, and Cauda Draconis, the dragon's tail or South Node. The Moon's North Node is the point where the Moon crosses the ecliptic from south to north; this intersection is used as the starting point, or 0° of Aries, to cast a chart based on the draconic zodiac. Unlike the tropical zodiac of solar origin, the draconic zodiac responds to lunar symbolism and therefore expresses unconscious motivations that affect our daily life.","is_active": true,"created": "2021\/06\/01"}
{"name": "Inspired by Music","author": "Amy Shapiro and Michaela Meiser","picture_src": "https:\/\/www.astro.com\/im\/in\/opa2105_hp.png","tags": [],"description": "Vienna 1918. In that intensely crisis-ridden time of change - like today, with Pluto-Eris and other major squares - Dr. Oskar Adler, a then 42-year-old Austrian medical doctor and musician, connects his philosophical musings, astrological insights and experiences as concert violinist and lecturer in a script that explores the essence and source of music: The Critique of Pure Music.","is_active": false,"created": "2021\/05\/20"}
{"name": "The Responsible Use of Astrology","author": "Tem Tarriktar","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2105_hp.jpg","tags": ["Responsible","Astrology"],"description": "Astrology deals with the patterns of our bodies and minds. Granted, knowing more about all these things is useful, especially for young people trying to get established, to find people they are compatible with and to find their place in the world. Astrology definitely has value and can be a wonderful tool for evolution.","is_active": true,"created": "2021\/05\/11"}
{"name": "Awaken Yourself as the Celestial Nexus","author": "Russ von Ohlhausen","picture_src": "https:\/\/www.astro.com\/im\/in\/ivccn2105_hp.png","tags": [],"description": "The 'Center of your Universe' is you! The moment you pick any point of reference, that point becomes the prime axis of everything else. The greatest consequence of the cosmological principle is that it implies that all parts of space are causally connected. You may think of yourself as a separate finite being; you are in fact, infinite.","is_active": true,"created": "2021\/05\/05"}
{"name": "The Astrology of Adolescence - A Psyche-in-Progress","author": "Erin Sullivan","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2105_hp.jpg","tags": [],"description": "Adolescence marks the first step toward conscious individuation. Out of the tantrums of the two-and-a-half-year-old, and the cleverness of the seven-year-old, into the assertiveness and confidence of the 10-year-old, there emerges suddenly a mysterious thing. At the first opposition of Saturn to itself, a new being materialises through the psyche.","is_active": true,"created": "2021\/05\/03"}
{"name": "The Library of Esoterica: ASTROLOGY","author": "Karin Hoffmann","picture_src": "https:\/\/www.astro.com\/im\/in\/rev_taschenastrology_hp.jpg","tags": ["Esoterica"],"description": "ASTROLOGY is a handsome book, good and heavy in the hand, carefully bound and beautifully designed. It is the kind of book you like to run your hand over, inhaling its fresh-from-the-press scent before turning to its contents. At least if, like me, you're an appreciative Taurus. ʺAs goes the form, so goes the contentʺ. The book not only has a ʹpretty faceʹ but also substance.","is_active": true,"created": "2021\/04\/29"}
{"name": "How to Finesse Difficult Chart Issues","author": "Kay Taylor","picture_src": "https:\/\/www.astro.com\/im\/in\/opa2104_hp.jpg","tags": ["Finesse"],"description": "The art of addressing difficult issues shown in the chart may be one of the most challenging issues that consulting astrologers face. Astrology is a symbolic language. We learn through study or personal and client experience what these symbols may mean, yet there is a range of possibilities for each planet and sign to manifest in actual reality.","is_active": true,"created": "2021\/04\/20"}
{"name": "Jupiter Conjunct the Sun: The Self-Expansion Transit","author": "Kathy Rose","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2104_hp.jpg","tags": [],"description": "Life does feel more purposeful when we are in a period of personal expansion. In such a dynamicphase of development, we enjoy an exhilarating sense of fulfillment and happiness. The force of growth is incredibly exciting and uplifting. During anenergized cycle of forward momentum, we are moved off our secure plateau of comfort, and we understand that we can have more in life.","is_active": true,"created": "2021\/04\/14"}
{"name": "The Subjective and Projective Character of Astrology","author": "Richard Vetter","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2104_hp.jpg","tags": [],"description": "What is the cause of the effect of astrology; what is its way of  functioning? On which mental or physical or psychological mechanisms is it  grounded? Why do statistical tests to prove it always fail? My thesis of  astrology as being primarily of a subjective and projective nature may sound  provocative. Yet in what follows, I list a series of points or hints to support  this epistemologically.","is_active": true,"created": "2021\/04\/01"}
{"name": "Pluto in Aquarius - Liberty, Equality, Fraternity","author": "Michele Finey","picture_src": "https:\/\/www.astro.com\/im\/in\/ivccn2103_hp.jpg","tags": ["Pluto","Aquarius","Liberty","Equality","Fraternity"],"description": "The sign in which Pluto is located marks out generational themes of  historical significance. It brings deep transformation and upheaval to matters  associated with its sign placement. Owing to Pluto's elliptical orbit, these  turbulent periods of history span between 13 to 33 years. In 2008 Pluto shifted  into Capricorn and the global financial crisis hit. Since then, we have  witnessed tremendous turmoil across the political and economic spectrum. Now we  are entering a new era of social revolution that will shake the foundations of  the global community in new ways.","is_active": false,"created": "2021\/03\/23"}
{"name": "There's No There, There. Or is there? - Understanding Elemental Voids","author": "Jennifer Zahrt","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2103_hp.jpg","tags": [],"description": "You're always drawn towards your weakest element, says astrologer  Steve Cozzi. This mantra can be found throughout modern  astrological lore. But what if it's the other way around? What if lacking an  element isn't a weakness, but a strength? In this article, I explore another  way to understand what having an elemental “void” in a chart might mean.  The urgency to write about elemental  voids comes from the current astrological weather, what could be called “The  Fire Void of 2021.”","is_active": true,"created": "2021\/03\/10"}
{"name": "Chiron Expands its Meaning - Towards a Holistic View","author": "Manuel Ignacio Quiles","picture_src": "https:\/\/www.astro.com\/im\/in\/mqchiron_hp.jpg","tags": ["Chiron","Holistic"],"description": "The asteroid Chiron is  increasingly important in the eyes of astrologers, and like Pluto, despite its  size, its archetypal and cosmic strength is undoubted. As time passes since its  discovery in 1977, its meaning deepens to unsuspected levels. I observe that the interpretation of this new celestial body  is in practice very different from author to author -or very simplified-, so I  think this essay is useful to try to expand, clarify and synthesize the field  of meanings.","is_active": false,"created": "2021\/03\/08"}
{"name": "Astrology as a light that shines in the dark or the quest for hope in this time of chaos","author": "Alejo López","picture_src": "https:\/\/www.astro.com\/im\/in\/rs2103_hp.jpg","tags": [],"description": "Astrology and its archetypes may guide us in  searching for some answers. And those answers may not be straight and clear but  perhaps elusive, as a sea of fog that is encouraging us to sail through it  without a fixed course. It is not a black or white matter that can be solved  with definite answers. It may be asking a more symbolic approach,  representative of the needs to address the crises that we face today. Maybe we  are not being asked to see the world from the immediate and literal point of  view.","is_active": false,"created": "2021\/03\/02"}
{"name": "Winning with a 12th House - A Fresh Perspective on this Obscure Corner of the Zodiac","author": "Maurice Fernandez","picture_src": "https:\/\/www.astro.com\/im\/in\/opa2103_hp.jpg","tags": [],"description": "My personal relationship with the 12th house began well  at birth, when my Moon, ruler of my Ascendant, rose from the horizon into my 12th  house. I can imagine its powerful light rising a couple of fists above the  eastern horizon. When I first got into astrology, I was excited to get a  reading from the prominent astrologer, a published author who was the big name  on radio shows. He spent the two hours of the reading warning me of the perils  of my self-sabotaging tendencies ...","is_active": true,"created": "2021\/03\/02"}
{"name": "Astrology in Art - Cosmic Harmony and Aesthetics","author": "Klemens Ludwig","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2103_hp.jpg","tags": ["Astrology","Cosmic","Harmony"],"description": "Astrological symbolism  has inspired many great artists. In this panoramic survey, the President of the  German Astrologers' Association takes us on a journey from prehistoric cave art  to the 21st century via Titian, da Vinci, Dali, Warhol, Hilma af  Klint, Hundertwasser and many more.","is_active": false,"created": "2021\/03\/01"}
{"name": "Taurus and Scorpio, an unlikely alliance","author": "Alvaro Artagaveytia","picture_src": "https:\/\/www.astro.com\/im\/in\/al2102_hp.png","tags": [],"description": "The  zodiacal mechanism is composed in principle of twelve pieces that contain  various peculiarities, not only because of their own nature (have you ever  thought that they are eleven members of a fantastic animal kingdom and a  measuring instrument called Libra), but also because of their natural  placement.","is_active": false,"created": "2021\/02\/09"}
{"name": "'The United States' Pluto Return","author": "Ray Grasse","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2102_hp.jpg","tags": ["The United States","Pluto"],"description": "Like  individuals, nations experience \"planetary returns,\" too, when celestial bodies return to the zodiacal position they  once occupied. But the full  return cycle of Pluto takes over 240 years to  complete. While  individual life-spans obviously aren't long enough to experience one of these,  nations and empires certainly can. Using July 4, 1776 as its birthdate, the  United States is on the verge of experiencing its first Pluto return. So, what does this mean for the United States?","is_active": false,"created": "2021\/02\/08"}
{"name": "The Dance between Light and Darkness","author": "Wendy Stacey","picture_src": "https:\/\/www.astro.com\/im\/in\/opa2101_hp.png","tags": ["Light","Darkness"],"description": "Throughout most of the year 2021, Saturn and  Uranus will be battling it out with the final three squares of their cycle, from the signs of Taurus and Aquarius. The understanding of these two zodiac signs,  Taurus, and Aquarius, can be understood within the Maori creation myth and  where the attention to all things earth and all things sky become entrenched in  the collective consciousness.","is_active": false,"created": "2021\/02\/02"}
{"name": "Pan and the Pandemic - Love in the Time of Capricorn","author": "Brian Clark","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2102_hp.jpg","tags": ["Pandemic"],"description": "It was the great god Pan who lent his name to 'pan-ic', 'pan-demonium' and  'pan-demic'. Myths  educate us about irrational forces that prompt fear, rendering them to some  extent understandable. In  the midst of the Covid-19 crisis and global lockdown, the road of imaginal  symbolism takes  us to new ways of perceiving that which seems threatening and incomprehensible.","is_active": true,"created": "2021\/02\/01"}
{"name": "Mercury Rx in Aquarius - From Rebellion to New Vision and Revolution","author": "Rosana Cueto Merayo","picture_src": "https:\/\/www.astro.com\/im\/in\/rcm_mercury_1.jpg","tags": ["Mercury","Aquarius"],"description": "On January  15th Mercury set up for the first of its retrogressions in the Air  signs, with the retrograde station occurring on January 30th at 26º  Aquarius and the direct station at 11º Aquarius, on February 21st.  With all the emphasis placed on the Air element throughout this year we are  being summoned to deconstruct our minds, so that we can  transition into new vision and access a new inner pantheon of power.","is_active": true,"created": "2021\/01\/22"}
{"name": "Delphine Boël - Astro-narrative of Belgium's royal love child scandal","author": "Frank C. Clifford","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2101_hp.jpg","tags": ["Belgium"],"description": "'I became famous by shame. I was the dirty laundry of King Albert.' So said Delphine Boël, the secret love child of Albert II, King of Belgium. Her struggle for  acceptance and her royal birthright were an ongoing media story for over 20  years – one that was only brought to a conclusion recently in an unprecedented,  highly-publicised fashion.","is_active": false,"created": "2021\/01\/13"}
{"name": "Lois Rodden - A personal and professional recollection","author": "Frank C. Clifford","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2101_hp.png","tags": ["professional"],"description": "It is easy to be  inspired by Lois Rodden and her 40-year commitment to data collection. She  dedicated her career to setting professional standards by classifying data  sources and demanding that astrologers take accountability for the data they  presented in lectures, articles, and books. She motivated me and countless  others to question and record sources, and to hunt down accurate data and share  these with others.","is_active": false,"created": "2021\/01\/12"}
{"name": "The Celestial Way - Horizontally and Vertically","author": "Bernard Duchatelle","picture_src": "https:\/\/www.astro.com\/im\/in\/ivccn2102_hp.jpg","tags": [],"description": "The starry skies fascinate us since prehistoric times,  not only for their sparkling splendor and seemingly immutable order, but also  for the significance we offer them: all astrological systems are based on the  exposure of a mysterious link, mainly made up of meaning, which associates our  lives with celestial geometry. The interpretations and uses we make of  this link assist our lives in many ways. Astrology illuminates all areas of  existence and greatly expands our self-knowledge, helping us to dispel our  fears and realize our aspirations.","is_active": false,"created": "2020\/12\/22"}
{"name": "Exploring our Full Self - Working with the Antiscia","author": "Richard Smoot","picture_src": "https:\/\/www.astro.com\/im\/in\/ivccn2012_smoot_hp.jpg","tags": [],"description": "Much of western tropical astrology focuses  on our external actions and inner psychological interconnection. Humans are far  more complex than these two arenas. It is my belief that it is the journey of a  human's life to explore all facets of experience; both our social selves and  our animal selves. Much of these deeper human realms can be found in the use of  Antiscia points.","is_active": true,"created": "2020\/12\/22"}
{"name": "Preparing for the Jupiter-Saturn Conjunction and Saturn-Uranus Square","author": "Greg Bogart","picture_src": "https:\/\/www.astro.com\/im\/in\/gb_jupsatura_hp.png","tags": ["Jupiter-Saturn","Saturn-Uranus","Conjunction"],"description": "During this time of uncertainty, the wisdom of astrology can help us surf the changes and achieve a calm inner center. This comes from understanding the current transiting situation affecting all of us and also the implications and possibilities of one's personal transits and what they're asking each of us to do here and now. Today's presentation considers how we can embody and focus the energy potential of this month's Jupiter-Saturn conjunction at 0 Aquarius 29, and other transits of 2021.","is_active": true,"created": "2020\/12\/18"}
{"name": "An Introduction to Minor Progressions","author": "Greg Bogart and Tem Tarriktar","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2012_hp.jpg","tags": ["Minor","Progressions"],"description": "In this article, we will  explore the use of a method known as minor  progressions, in which one lunar month after birth is viewed as equivalent to one year of life. While secondary progressions consider the rotation of the Earth around  the Sun as primary, this method considers the orbit of the Moon as another  factor that defines a cycle that can be related symbolically to the cycles of  human experience. Thus, if you are 30 years of age, look (in the ephemeris) for  the Moon's 30th return to its natal position after birth to find the  positions of your minor  progressed planets for  your 30th birthday.","is_active": false,"created": "2020\/12\/14"}
{"name": "The Jupiter & Saturn Conjunction in Aquarius and the Rebel Archetype","author": "Rosana Cueto Merayo","picture_src": "https:\/\/www.astro.com\/im\/in\/rcm_satjup_hp.jpg","tags": ["Jupiter","Saturn","Archetype"],"description": "2020 is coming to an end and Saturn and Jupiter are just about to delight us with the  first and last exact conjunction they are making in this year, and that  will remain in orb through January and February 2021. It is such a beautiful  synchronic event that both social planets should ingress into the sign of  Aquarius hand in hand that we cannot but pay  close attention to the symbolic implications of this happy (?) \"co-incidence\".","is_active": true,"created": "2020\/12\/09"}
{"name": "Is Astrology Returning to an Age of Endarkenment?","author": "Robert Currey","picture_src": "https:\/\/www.astro.com\/im\/in\/aa2012_hp.jpg","tags": [],"description": "How can astrology avoid fragmentation or sinking  back into obscurity as sceptical scientists such as Prof. Brian Cox try to  debunk what they do not understand? One answer lies in putting more effort into  research in an age of evidence-based knowledge. Astrology  has reincarnated more often than Kenny in South Park. Our last decline  coincided with the final demise of the Renaissance along with Galileo, Kepler  and Lilly during the 17th century. While the West entered the Age of  Enlightenment, astrology entered an Age of 'Endarkenment'.","is_active": false,"created": "2020\/12\/01"}
{"name": "Ephemeris - A Game of Astronomical Strategy","author": "Karin Hoffmann","picture_src": "https:\/\/www.astro.com\/im\/in\/rev_ephemerisgame_hp.jpg","tags": ["Ephemeris"],"description": "EPHEMERIS is a game of astronomical strategy for 2 to 4 (or 7) players that can be played in two quite different ways. The first is a game of strategy (and luck), the second adds some cleverness (or lucky guesses) to the equation. Either way, it's a fun game!","is_active": true,"created": "2020\/11\/30"}
{"name": "The Dark Star - Nebula M22 in the Natal Chart of Stargazers","author": "Patrizia Nava","picture_src": "https:\/\/www.astro.com\/im\/in\/ivccn2012_hp.jpg","tags": ["Star"],"description": "Asterisms, clusters, galaxies and nebulas are  among the most fascinating objects that the deep sky offers to the amazed eyes  of stargazers. In spite of their beauty, they generally get a bad press, since  they are often related to eyesight problems, blindness, accidents and even  violence by ancient astrological sources, and not without reason. However, as  poet Sarah Williams wrote, those who really love the stars cannot be afraid of  the night, nor of their dark side. Let's examine them better.","is_active": false,"created": "2020\/11\/27"}
{"name": "Planetary Functions in AstroHology - Planets and Holistic Consciousness","author": "Vanesa Maiorana and Alejandro Luna","picture_src": "https:\/\/www.astro.com\/im\/in\/ah_functions_hp.jpg","tags": ["Planetary","AstroHology"],"description": "Donec ut dolor. Morbi vel lectus in quam fringilla rhoncus. Mauris enim leo, rhoncus sed, vestibulum sit amet, cursus id, turpis. Integer aliquet, massa id lobortis convallis, tortor risus dapibus augue, vel accumsan tellus nisi eu orci. Mauris lacinia sapien quis libero.","is_active": true,"created": "2020\/11\/18"}
{"name": "Learning in the Time of Corona","author": "Alex Trenoweth","picture_src": "https:\/\/www.astro.com\/im\/in\/opa2011_hp.jpg","tags": [],"description": "The  past few months in quarantine has seen an exponential increase in online  meetings (including astrological consultations) as well as contactless  opportunities for learning. The medical profession, online companies with the  resources to provide delivery, and technology companies such  as Zoom and gaming platforms are booming. These developments appear to be the good  news.","is_active": true,"created": "2020\/11\/18"}
{"name": "Traditional Astrology in a Modern Practice - Let There be Lights","author": "Wonder Bright","picture_src": "https:\/\/www.astro.com\/im\/in\/tma_bright_hp.jpg","tags": ["Traditional","Astrology"],"description": "For three years of my childhood, we lived far away from any cities or towns. At night it was dark. True dark. One such night, my family trudged through fresh snow across a hilltop clearing. At the peak my mother halted us, saying in hushed tones, “oh my gosh you guys, look at this.” We stood still there for a long moment, taking in the scene. There was no moon that night, just the brightness of the stars reflected on the glistening snow pack, casting soft glows upon our faces. The mountain ridges in the background, spiky with fir trees, stretched into the distance. “Aren't we lucky?” my mother asked reverently.","is_active": false,"created": "2020\/11\/10"}
{"name": "Generational Shifts and the Jupiter-Saturn Mutation","author": "J. Lee Lehman","picture_src": "https:\/\/www.astro.com\/im\/in\/aa_lehman_mutation_hp.png","tags": ["Generational","Jupiter-Saturn","Mutation"],"description": "'Baby  Boomers are creatures of the earth cycle. Millennials are creatures of air. Gen  X-ers are transitional, being born of earth, but growing up in air.' As the  next Jupiter-Saturn conjunction (21 December 2020) marks an elemental shift (or  mutation) from earth to air, what awaits the world next based on past  mutations?","is_active": true,"created": "2020\/11\/02"}
{"name": "Astro-Palmistry - an Introduction","author": "Peter Burns","picture_src": "https:\/\/www.astro.com\/im\/in\/ivccn_burns_palmistry_hp.jpg","tags": [],"description": "Astrology and palmistry are 'sister' arts, meaning that they are very closely related, like siblings. In the West, astrology dominates with many more practitioners, and palmistry is seen as 'a poor cousin' and is little understood. This article seeks to throw light on the intimate links between astrology and palmistry.","is_active": true,"created": "2020\/10\/28"}
{"name": "Pluto's Riches","author": "Shawn Nygaard","picture_src": "https:\/\/www.astro.com\/im\/in\/tma2010_hp.png","tags": [],"description": "The dwarf planet Pluto in astrology is often met with tremendous trepidation. Pluto's difficult reputation is well earned, given that this Roman god is the ruler of the Underworld, the realm of the dead. Yet, it's also curious to consider that the word itself, pluto, means “riches,” “the wealthy one,” or “the wealth-giving”.","is_active": false,"created": "2020\/10\/12"}
{"name": "Mystery Tragic Event","author": "Britanie Leclair","picture_src": "https:\/\/www.astro.com\/im\/in\/opa_leclair_mystery_hp.png","tags": [],"description": "For  the third column in OPA's forensic astrology series, I was presented with five  mystery charts pertaining to a single violent event. It was revealed that the  victim had been beaten to death at the time indicated by the event chart, but  no other details were provided. This exercise aims to help demonstrate how  astrological charts could be interpreted in a real-life situation with very  little background information to go on.","is_active": false,"created": "2020\/10\/06"}
{"name": "The media star-sign horoscope debate","author": "Anne Whitaker and Victor Olliver","picture_src": "https:\/\/www.astro.com\/im\/in\/aa_olliver_sunsigs_hp.jpg","tags": ["media"],"description": "She's rather  sniffy about those Sun-sign columns we find in newspapers and magazine. He  thinks they serve a useful purpose for astrology. The two stepped into the  metaphorical boxing ring to settle the matter. Ding, ding..","is_active": false,"created": "2020\/10\/02"}
{"name": "Swedish Artist Hilma af Klint Channels her Spirit Guides","author": "Agneta Borstein","picture_src": "https:\/\/www.astro.com\/im\/in\/ivccn_borstein_hp.jpg","tags": [],"description": "Born in Stockholm, Sweden on October 26,  1862, (no exact birth time) abstract artist, Hilma af Klint requested in her will that her art not to be  shown publicly until twenty years after her death. It would take forty-two  years for the public to view her vibrant, mystical, some 10 x 8 feet tall  paintings at Los Angeles County Museum of Art, in Los Angeles, California in  November of 1986. She firmly stated  that her art would not be understood by the public during her lifetime.","is_active": false,"created": "2020\/09\/22"}
{"name": "Dim All the Lights - Some Musings on Saturn-Pluto, the Most Feared Combination in Astrology","author": "Frank C. Clifford","picture_src": "https:\/\/www.astro.com\/im\/in\/tma_clifford_satplu_hp.jpg","tags": ["Meat"],"description": "Some of us shudder when we think of Saturn transits or panic when  Pluto inches towards a major area of our chart. Both planets have dark, fearsome  reputations and this year we've seen how their conjunction in Capricorn in mid  January coincided with the  start of a prolonged period in many societies of  personal and economic hardship (Saturn) amid an atmosphere of fear (Saturn),  suspicion, and panic (Pluto). We've witnessed an enforced (Pluto) pause  (Saturn) to everyday life — a lockdown (a great Saturn-Pluto word) with much of  the world 'temporarily closed for renovation.'","is_active": true,"created": "2020\/09\/14"}
{"name": "Irreconcilable Differences - Or, How to Save a Marriage","author": "Andrew McDonald","picture_src": "https:\/\/www.astro.com\/im\/in\/aa_mcdonald_marriage_hp.jpg","tags": ["Irreconcilable"],"description": "The problem with approaching many  counsellors with the difficulties of your rocky marriage is that most therapies  have a bias, whether implicit or explicit, towards a kind of determinism: 'This  is happening because of (...) occurring when you were (...)' - fill in the blanks with particular traumatic life events and age. And the problem with  approaching most astrologers for guidance on a rocky marriage is that they,  too, are working from a deterministic bias: 'This is happening because of (...)  on your (...)'; - fill in the blanks with planets and position in the  astrological chart.","is_active": false,"created": "2020\/09\/01"}
{"name": "Indigenous Astrology and the Celtic Wisdom Wheel","author": "Gaisheda Kheawok","picture_src": "https:\/\/www.astro.com\/im\/in\/ivccn_kheawok_hp.jpg","tags": ["Indigenous","Astrology"],"description": "The Tribal Teachings recognize that we are One  with all aspects of the Creation Story. Individual psychological growth cannot be separated from that of the  collective, nor from the consciousness of the Earth, her Elemental Teachers and  the rhythms of the solar lunar calendars. Indigenous people have long recognized the rhythm of the natural world  in concert with the lunar and solar cycles.","is_active": false,"created": "2020\/08\/25"}   
{"name": "The Challenge of Exo-Astrology - Or, How Would We Construct Horoscopes on Other Planets?","author": "Ray Grasse","picture_src": "https:\/\/www.astro.com\/im\/in\/rg_exoastrology_hp.jpg","tags": [],"description": "How much of what we use and assume in erecting horoscopes is truly  universal, applicable anywhere in the universe, and how much is strictly  cultural and local, not exportable anywhere beyond the confines of our own  little corner of space and time? Was there an archetypal basis to astrology  that could be applied anywhere, and if so, what did it consist of? And if not,  what might those exotic forms of astrology in other locales look like?","is_active": false,"created": "2020\/08\/18"}
{"name": "Reflections on Vocational Astrology in a Pandemic Era","author": "Greg Bogart","picture_src": "https:\/\/www.astro.com\/im\/in\/opa_bogart_hp.jpg","tags": [],"description": "With Jupiter,  Saturn, and Pluto transiting in Capricorn in 2020 this is an appropriate time  to focus on vocational astrology - the art of skillfully guiding ourselves and  our clients in the world of work, to aid career decision making, but also to  cope with career setbacks and defeats, workplace stress, burnout, unemployment,  changes of occupation, and retirement.","is_active": false,"created": "2020\/08\/14"}
{"name": "Paradigm Shifters and the New Planet, Eris","author": "Henry Seltzer","picture_src": "https:\/\/www.astro.com\/im\/in\/tma_seltzer_eris_hp.jpg","tags": ["Paradigm"],"description": "In this article, we will be taking an astrological look at those  individuals who have gone against the grain of established science or culture  in order to develop their own unique viewpoint and, in so doing, created a new  way of seeing the world around them. I am speaking most specifically of those  individuals throughout the history of science who were instrumental in bringing  about what is now known as a 'paradigm shift' by changing the rules of the game  — the pre-existing 'laws of nature.'","is_active": true,"created": "2020\/08\/07"}
{"name": "Who wrote Shakespeare? Astrology Lifts the Veil","author": "Phoebe Wyss","picture_src": "https:\/\/www.astro.com\/im\/in\/aa_wyss_shakespeare_hp.jpg","tags": ["Shakespeare","Astrology","Veil"],"description": "Did Shakespeare write Shakespeare? For years  conspiracy theories have raged round the authorship of his plays. Could these  dramatic masterpieces so dense in meaning, so rich in allusions, exhibiting  such deep wisdom and extensive life experience, have been written by the son of  a country tradesman with little education?","is_active": false,"created": "2020\/07\/29"}
{"name": "Hollywood and the Neptune Factor - How Neptune's Transits Have Shaped the Movies","author": "Ra Rishikavi Raghudas","picture_src": "https:\/\/www.astro.com\/im\/in\/ivccn_raghudas_hp.png","tags": ["Hollywood","Neptune Factor","Transits"],"description": "In modern astrology, everything that belongs to the boundless, the unfettered, the selfless--is said to belong to Neptune's realm. Neptune is the God principle and the creative Muse--that elusive thing we call magic. This profound energy is deeply embedded in the human heart, which flees from the ordinary, and seeks to dream. And for that purpose--we have the cinema.","is_active": false,"created": "2020\/07\/22"}
{"name": "Buckle Up for Mars Retrograde in Aries","author": "Pam Gregory","picture_src": "https:\/\/www.astro.com\/im\/in\/tma_gregory_hp.png","tags": ["Retrograde"],"description": "Mars transiting through its  own sign of Aries is extremely dynamic and will dominate the second half of  2020, especially during the retrograde phase from September 9 to November 13. Mars retrogrades approximately every two years, but it rarely does so in  the sign of Aries. It happened last in 1988 and won't  occur again until 2067. This year Mars will be much more powerful than it was  in 1988, as it will form repeated squares to Jupiter, Saturn, and Pluto in Capricorn.","is_active": false,"created": "2020\/07\/08"}
{"name": "'It Was a Bit Crowded' - Charles', Diana's and Camilla's Personal Name Asteroids and Sabian Symbols Fill the Palace with Meaning","author": "Duncan McCollum","picture_src": "https:\/\/www.astro.com\/im\/in\/opa_mccollum_hp.jpg","tags": [],"description": "One of the biggest challenges of reading natal charts  is understanding how a person sees themselves, whether they are a client or  public figure. Astrologers know that without the context of knowing a person  well, it can be very difficult to discern their self-image. How one views and  relates to themselves is a critical element in understanding behavior, but it  is information not often revealed to others except close friends, partners, or  therapists. One way to gain some insights into a person's  self-image is to use a personal name asteroid in the birth chart.","is_active": false,"created": "2020\/07\/03"}
{"name": "The Planetary Day and Personality","author": "William Trav Travers","picture_src": "https:\/\/www.astro.com\/im\/in\/aa_travers_hp.jpg","tags": [],"description": "It was believed in days gone by that a child's temperament could be  influenced by the day of the week it was born. The following old poem below was  designed to teach children the days of the week and is one of many old  fortune-telling poems illustrating a traditional belief in the planetary link  between the days of the week, a child's personality and what fate had in store  for them.","is_active": false,"created": "2020\/07\/01"}
{"name": "Day and Night: Different Approaches to Chart Interpretation Depending on Diurnal or Nocturnal Birth Time","author": "Karine Dilanian","picture_src": "https:\/\/www.astro.com\/im\/in\/ivccn_dilanian_hp.jpg","tags": [],"description": "The doctrine of sect, or division of the astrological  chart into a diurnal and a nocturnal one, became one of such rediscovered  doctrines.  Brennan points out that the concept of sect was one of those innovative doctrines, which appeared in  Hellenistic astrology and demonstrated that Hellenistic astrology was becoming  more complicated and disconnected from the earliest astrological tradition.","is_active": true,"created": "2020\/06\/16"}
{"name": "Kairos - Opportunity in the Time of Capricorn","author": "Brian Clark","picture_src": "https:\/\/www.astro.com\/im\/in\/bc_kairos_hp.jpg","tags": ["Kairos","Capricorn"],"description": "The streets of London and New York and Tokyo and Paris  are almost empty. Their celebrated boulevards and urban alleyways like a  wasteland. The high-end shops are closed, some boarded up: no shoppers, no  trade, no commerce. No pubs, no restaurants, no mass, no Olympics. What is  non-essential, yet part of daily life, is closed. New rules apply. It is not a  science fiction film set, so what are we seeing?","is_active": false,"created": "2020\/06\/09"}
{"name": "A Practical Guide to Writers of Astrology","author": "Frank C. Clifford","picture_src": "https:\/\/www.astro.com\/im\/in\/aa_clifford_writer_hp.jpg","tags": ["Practical","Guide","Astrology"],"description": "In this article I'll be  discussing the various ways in which astrologers can get their work published and offering  advice about approaching magazines and publishers. I'll also provide some tips  on how to start the writing process and to discover your niche as a writer. There are plenty of websites and books dedicated to writing and getting  published. But I'd like to focus on what I've learned as a  writer and publisher in the area of astrology.","is_active": true,"created": "2020\/06\/02"}
{"name": "Dane Rudhyar - Astrology for the Modern Psyche","author": "Chet Zdrowski","picture_src": "https:\/\/www.astro.com\/im\/in\/opa_rudhyar100.jpg","tags": ["Dane Rudhyar","Astrology","Psyche"],"description": "Dane Rudhyar is a towering figure in modern astrology. Long after his passing in 1985 he continues to have a pervasive influence on much of modern astrology, especially evolutionary and psychological forms. Many of his later works are relatively unknown and there are many treasures for coming generations of astrologers to discover in them. Here we'll be taking a look at his first astrology book, one of the craft's most ground-breaking and enduring classics, The Astrology of Personality.","is_active": true,"created": "2020\/05\/19"}
{"name": "Lilith - Black Moon: A Golden Ally in the Astrological Interpretation","author": "Grazia Mirti","picture_src": "https:\/\/www.astro.com\/im\/in\/ivccn_mirti_lilith_hp.jpg","tags": ["Lilith"],"description": "In this article I shall discuss the important role played by Lilith-Dark Moon in our astrological  analyses. I have researched the effects of Lilith-Dark Moon for many years; I  now regularly include the study of Lilith-Dark Moon in my daily astrological  practice. In my view, it is important to consider Lilith-Dark Moon's role in a  wider sense: not only as a symbol of feminine empowerment and transformation,  but also as a useful indicator of our unfulfilled wishes, lacks and areas of  our lives which need to be more carefully addressed.","is_active": true,"created": "2020\/05\/06"}
{"name": "A global transition - The astrology of Coronavirus","author": "Wendy Stacy","picture_src": "https:\/\/www.astro.com\/im\/aa_corona.jpg","tags": ["astrology","Coronavirus"],"description": "With much of the world in lockdown to beat Covid-19, this pandemic correlates to the January 2020 Capricorn Saturn-Pluto conjunction and other planetary cycles. Despite global fear and looming economic challenges, astrology sees the larger picture and the route map to a whole new Aquarian and better world.","is_active": true,"created": "2020\/05\/04"}
{"name": "Saturn as the Key 'Karmic' Challenge of the Horoscope","author": "Ray Grasse","picture_src": "https:\/\/www.astro.com\/im\/in\/tma_grasse_karma_hp.jpg","tags": ["Saturn","Karmic","Horoscope"],"description": "More years  ago than I care to remember, I heard a visiting astrologer make the offhand comment that Saturn's placement in the horoscope indicates where one's key karmic challenge in this lifetime is having thought about that astrologer's comment quite a bit since first hearing it, I've come to believe there is indeed something unique about Saturn as representing an especially focused symbol of one's current life-challenges.","is_active": false,"created": "2020\/04\/20"}
{"name": "Heaven in a Wild Flower: Reflections on Imagination","author": "Brian Clark","picture_src": "https:\/\/www.astro.com\/im\/in\/aa_clark_wildflower_hp.jpg","tags": ["Reflections","Imagination"],"description": "To the uninitiated,  the horoscope is a chart of squiggles and glyphs. To the astrologer it is a map  of revelatory symbols; either way it evokes an imaginal space. The focus on techniques  has its place, but what of the role of the imagination which in astrology is  the key to unlocking the 'sacred shards of the soul'? To answer that question, we must go to another place beyond the intellect.","is_active": true,"created": "2020\/04\/01"}
{"name": "StarGates: Planetary Portals and Windows in Time","author": "Ray Grasse","picture_src": "https:\/\/www.astro.com\/im\/in\/rg_stargates_hp.jpg","tags": ["StarGates"],"description": "Besides  making two groundbreaking scientific discoveries, the scientist Joseph Priestley published major papers on electricity, invented new apparatuses for the  creation of electrical charge, isolated and named ten distinct gases, and wrote more than  fifty books and pamphlets on politics, education, and faith. What explains why certain historical periods are times when new ideas burst onto the scene in profusion?","is_active": true,"created": "2020\/03\/04"}
{"name": "Paradox and the Saturn-Pluto Cycle: 'In my end is my beginning...'","author": "Anne Whitaker","picture_src": "https:\/\/www.astro.com\/im\/in\/aa_whitaker_satplu_hp.jpg","tags": ["Paradox","Saturn-Pluto"],"description": "In East Coker, the second of T.S. Eliot's Four Quartets, he began that section with, 'In my beginning is my end;' and ended it, 'in my end is my beginning'. This rather paradoxical juxtaposition bookends the whole of life. Every beginning carries the seeds of its ending; every ending has potential for new beginnings. However, generally speaking, you don't find much astrological musing on the topic of cycles' endings - or their slow beginnings. Especially in this particular Western cultural phase. Expedited by faster and faster broadband speeds and ever more sophisticated technology, the emphasis is on satisfying the wants (often as opposed to the needs) of now.","is_active": false,"created": "2020\/03\/02"}
{"name": "Herschel, Uranus and Mary Shelley's Vision of Horror","author": "Alex Trenoweth","picture_src": "https:\/\/www.astro.com\/im\/in\/ivccn_trenoweth_herschel_hp.jpg","tags": [],"description": "As  schoolteacher, it was my privilege to teach the Gothic masterpiece Frankenstein . As I listened to my pupils  discussing the themes of the novel, it struck me how the defiance and  inventiveness of Victor Frankenstein seemed to match the astrological themes  found in Uranus and the themes of death and resurrection seemed to match those  of Pluto.","is_active": false,"created": "2020\/02\/25"}
{"name": "Crafting a Future with the Centaur's Cosmic Sandpaper: 2020 Transits of Chiron, Pholus and Chariklo","author": "David Leskowitz","picture_src": "https:\/\/www.astro.com\/im\/in\/opa_leskowitz_hp.jpg","tags": ["Centaur","Cosmic"],"description": "The third decade of this  millennium begins with conjunctions between Jupiter, Saturn, and Pluto. When  Saturn and Pluto conjoin, not only do they close one 36 year cycle to start  another, they serve to link our inner and outer spheres of experience. When  Saturnian limitations are exploded by Plutonic force, who would you call but  the Centaurs?","is_active": true,"created": "2020\/02\/19"}
{"name": "The Jupiter-Pluto Conjunction","author": "Alex Trenoweth","picture_src": "https:\/\/www.astro.com\/im\/in\/opa_trenoweth_jupl_hp.jpg","tags": ["Soup"],"description": "Mythologically, Jupiter and Pluto are  polar opposites. Jupiter is a sky god whose position in the heavens gave him  the ability to be omniscient, omnipotent and omnipresent. He was in charge of  laws and higher-order. Pluto was the god of the Underworld, powerful and  wealthy in his own right. Together, it would make sense that they could create  something big out of something small.","is_active": true,"created": "2020\/02\/19"}
{"name": "Star Profiles of Female Firebrands","author": "Sioux Rose","picture_src": "https:\/\/www.astro.com\/im\/in\/sr_firebrands_hp.png","tags": [],"description": "The economist studies financial trends, the political strategist studies polls, and the astrologer checks the pages in her ephemeris. Emerging from today's Capricorn emphasis arises the next Great Conjunction. As humanity approaches this Great Conjunction due next month, a number of dynamic female firebrands have entered the political limelight.","is_active": false,"created": "2020\/02\/12"}
{"name": "Element Imbalances: The Presence of Absence","author": "Carole Taylor","picture_src": "https:\/\/www.astro.com\/im\/in\/aa_taylor_elements_hp.jpg","tags": ["Element","Imbalances"],"description": "What can  it mean to have little (or be absent) of one of the four elements in a horoscope? How have  celebrated lives compensated for the so-called missing function? As the author  proposes: 'A void or a space or a lack provides an opening - a place where  something can be created'.","is_active": true,"created": "2020\/02\/03"}
{"name": "The Fibonacci Zodiac","author": "Russ von Ohlhausen","picture_src": "https:\/\/www.astro.com\/im\/in\/ivccn_ohlhausen_hp.jpg","tags": ["Fibonacci","Zodiac"],"description": "What is 'astrology'? What does it mean to each person who studies it, practices  it, profanes it or denounces it? You might think this would be a simple query  that is easily answered but as many of us in the field of astrology know, there  is no uniform or simple way to address this question. Is it art, is it science,  is it a form of spiritual discipline or is it a trailhead to understanding the  pathway to our higher potentials?","is_active": false,"created": "2020\/01\/27"}
{"name": "Reflections, Memories and Multiple Transits","author": "Fernanda Paiva","picture_src": "https:\/\/www.astro.com\/im\/in\/iam_paiva_hp.jpg","tags": ["Reflections","Memories","Transits"],"description": "I thought about writing this article on many  different topics within the astrological field, but what came out was the urge  to share a little about my experience having multiple transits, especially the  challenging Pluto transits to my personal planets and what has been learnt, a  mix of confirming the information provided in some of the classic astrological  text books, with what has personally been useful to me in order to survive a  time of multiple inner deaths and turmoil.","is_active": true,"created": "2020\/01\/17"}
{"name": "2020  - Pluto-Saturn Conjunction in Capricorn Leading to Jupiter-Saturn in Aquarius","author": "Roy Gillett","picture_src": "https:\/\/www.astro.com\/im\/in\/opa_gillett_hp.jpg","tags": ["Capricorn","Pluto-Saturn","Jupiter-Saturn"],"description": "To have four of  the five outer planets in earth signs is rare. To have Jupiter, Saturn and  Pluto in Capricorn, while Uranus is in Taurus has happened only one other year,  in the 10,000-year period 4999 BCE to 4999 CE. 3838 BCE was the time of the  Bronze Age and when there are first records of writing.","is_active": true,"created": "2020\/01\/10"}
{"name": "The Roots of Astrology","author": "André Barbault","picture_src": "https:\/\/www.astro.com\/im\/in\/aa_barbault_hp.jpg","tags": ["Roots","Astrology"],"description": "Despite rich sources of information provided  by archaeology, ethnology, anthropology and psychoanalysis, it is not easy to  imagine the sentient thoughts of people from a distant time when faced with the  universe. In addition to the access and the  perspectives provided by these disciplines, we would, somehow, have to return  to the womb of the alma mater.","is_active": true,"created": "2020\/01\/03"}

